// Generated by jextract

package org.libraw.linuxosx;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$89 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$89() {}
    static final VarHandle const$0 = constants$87.const$2.varHandle(MemoryLayout.PathElement.groupElement("max"));
    static final VarHandle const$1 = constants$87.const$2.varHandle(MemoryLayout.PathElement.groupElement("flags"));
    static final VarHandle const$2 = constants$87.const$2.varHandle(MemoryLayout.PathElement.groupElement("offset"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("image"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("raw_height"),
            JAVA_SHORT.withName("raw_width"),
            JAVA_SHORT.withName("height"),
            JAVA_SHORT.withName("width"),
            JAVA_SHORT.withName("top_margin"),
            JAVA_SHORT.withName("left_margin"),
            JAVA_SHORT.withName("iheight"),
            JAVA_SHORT.withName("iwidth"),
            JAVA_INT.withName("raw_pitch"),
            MemoryLayout.paddingLayout(4),
            JAVA_DOUBLE.withName("pixel_aspect"),
            JAVA_INT.withName("flip"),
            MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(4, JAVA_INT)).withName("mask"),
            JAVA_SHORT.withName("raw_aspect"),
            MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                JAVA_SHORT.withName("cleft"),
                JAVA_SHORT.withName("ctop"),
                JAVA_SHORT.withName("cwidth"),
                JAVA_SHORT.withName("cheight")
            ).withName("libraw_raw_inset_crop_t")).withName("raw_inset_crops"),
            MemoryLayout.paddingLayout(2)
        ).withName("sizes"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("guard"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("make"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("model"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("software"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("normalized_make"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("normalized_model"),
            JAVA_INT.withName("maker_index"),
            JAVA_INT.withName("raw_count"),
            JAVA_INT.withName("dng_version"),
            JAVA_INT.withName("is_foveon"),
            JAVA_INT.withName("colors"),
            JAVA_INT.withName("filters"),
            MemoryLayout.sequenceLayout(6, MemoryLayout.sequenceLayout(6, JAVA_BYTE)).withName("xtrans"),
            MemoryLayout.sequenceLayout(6, MemoryLayout.sequenceLayout(6, JAVA_BYTE)).withName("xtrans_abs"),
            MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("cdesc"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("xmplen"),
            RuntimeHelper.POINTER.withName("xmpdata")
        ).withName("idata"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("MinFocal"),
            JAVA_FLOAT.withName("MaxFocal"),
            JAVA_FLOAT.withName("MaxAp4MinFocal"),
            JAVA_FLOAT.withName("MaxAp4MaxFocal"),
            JAVA_FLOAT.withName("EXIF_MaxAp"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("LensMake"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Lens"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("LensSerial"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("InternalLensSerial"),
            JAVA_SHORT.withName("FocalLengthIn35mmFormat"),
            MemoryLayout.paddingLayout(2),
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("EffectiveMaxAp"),
                JAVA_BYTE.withName("LensIDNumber"),
                JAVA_BYTE.withName("LensFStops"),
                JAVA_BYTE.withName("MCUVersion"),
                JAVA_BYTE.withName("LensType")
            ).withName("nikon"),
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("MinFocal"),
                JAVA_FLOAT.withName("MaxFocal"),
                JAVA_FLOAT.withName("MaxAp4MinFocal"),
                JAVA_FLOAT.withName("MaxAp4MaxFocal")
            ).withName("dng"),
            MemoryLayout.structLayout(
                JAVA_LONG.withName("LensID"),
                MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Lens"),
                JAVA_SHORT.withName("LensFormat"),
                JAVA_SHORT.withName("LensMount"),
                MemoryLayout.paddingLayout(4),
                JAVA_LONG.withName("CamID"),
                JAVA_SHORT.withName("CameraFormat"),
                JAVA_SHORT.withName("CameraMount"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("body"),
                JAVA_SHORT.withName("FocalType"),
                MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("LensFeatures_pre"),
                MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("LensFeatures_suf"),
                MemoryLayout.paddingLayout(2),
                JAVA_FLOAT.withName("MinFocal"),
                JAVA_FLOAT.withName("MaxFocal"),
                JAVA_FLOAT.withName("MaxAp4MinFocal"),
                JAVA_FLOAT.withName("MaxAp4MaxFocal"),
                JAVA_FLOAT.withName("MinAp4MinFocal"),
                JAVA_FLOAT.withName("MinAp4MaxFocal"),
                JAVA_FLOAT.withName("MaxAp"),
                JAVA_FLOAT.withName("MinAp"),
                JAVA_FLOAT.withName("CurFocal"),
                JAVA_FLOAT.withName("CurAp"),
                JAVA_FLOAT.withName("MaxAp4CurFocal"),
                JAVA_FLOAT.withName("MinAp4CurFocal"),
                JAVA_FLOAT.withName("MinFocusDistance"),
                JAVA_FLOAT.withName("FocusRangeIndex"),
                JAVA_FLOAT.withName("LensFStops"),
                MemoryLayout.paddingLayout(4),
                JAVA_LONG.withName("TeleconverterID"),
                MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Teleconverter"),
                JAVA_LONG.withName("AdapterID"),
                MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Adapter"),
                JAVA_LONG.withName("AttachmentID"),
                MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Attachment"),
                JAVA_SHORT.withName("FocalUnits"),
                MemoryLayout.paddingLayout(2),
                JAVA_FLOAT.withName("FocalLengthIn35mmFormat")
            ).withName("makernotes")
        ).withName("lens"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("ColorDataVer"),
                JAVA_INT.withName("ColorDataSubVer"),
                JAVA_INT.withName("SpecularWhiteLevel"),
                JAVA_INT.withName("NormalWhiteLevel"),
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ChannelBlackLevel"),
                JAVA_INT.withName("AverageBlackLevel"),
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("multishot"),
                JAVA_SHORT.withName("MeteringMode"),
                JAVA_SHORT.withName("SpotMeteringMode"),
                JAVA_BYTE.withName("FlashMeteringMode"),
                MemoryLayout.paddingLayout(1),
                JAVA_SHORT.withName("FlashExposureLock"),
                JAVA_SHORT.withName("ExposureMode"),
                JAVA_SHORT.withName("AESetting"),
                JAVA_SHORT.withName("ImageStabilization"),
                JAVA_SHORT.withName("FlashMode"),
                JAVA_SHORT.withName("FlashActivity"),
                JAVA_SHORT.withName("FlashBits"),
                JAVA_SHORT.withName("ManualFlashOutput"),
                JAVA_SHORT.withName("FlashOutput"),
                JAVA_SHORT.withName("FlashGuideNumber"),
                JAVA_SHORT.withName("ContinuousDrive"),
                JAVA_SHORT.withName("SensorWidth"),
                JAVA_SHORT.withName("SensorHeight"),
                JAVA_INT.withName("AFMicroAdjMode"),
                JAVA_FLOAT.withName("AFMicroAdjValue"),
                JAVA_SHORT.withName("MakernotesFlip"),
                JAVA_SHORT.withName("RecordMode"),
                JAVA_SHORT.withName("SRAWQuality"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("wbi"),
                JAVA_SHORT.withName("RF_lensID"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("AutoLightingOptimizer"),
                JAVA_INT.withName("HighlightTonePriority"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("t"),
                    JAVA_SHORT.withName("l"),
                    JAVA_SHORT.withName("b"),
                    JAVA_SHORT.withName("r")
                ).withName("DefaultCropAbsolute"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("t"),
                    JAVA_SHORT.withName("l"),
                    JAVA_SHORT.withName("b"),
                    JAVA_SHORT.withName("r")
                ).withName("RecommendedImageArea"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("t"),
                    JAVA_SHORT.withName("l"),
                    JAVA_SHORT.withName("b"),
                    JAVA_SHORT.withName("r")
                ).withName("LeftOpticalBlack"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("t"),
                    JAVA_SHORT.withName("l"),
                    JAVA_SHORT.withName("b"),
                    JAVA_SHORT.withName("r")
                ).withName("UpperOpticalBlack"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("t"),
                    JAVA_SHORT.withName("l"),
                    JAVA_SHORT.withName("b"),
                    JAVA_SHORT.withName("r")
                ).withName("ActiveArea"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("ISOgain")
            ).withName("canon"),
            MemoryLayout.structLayout(
                JAVA_DOUBLE.withName("ExposureBracketValue"),
                JAVA_SHORT.withName("ActiveDLighting"),
                JAVA_SHORT.withName("ShootingMode"),
                MemoryLayout.sequenceLayout(7, JAVA_BYTE).withName("ImageStabilization"),
                JAVA_BYTE.withName("VibrationReduction"),
                JAVA_BYTE.withName("VRMode"),
                MemoryLayout.sequenceLayout(13, JAVA_BYTE).withName("FlashSetting"),
                MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("FlashType"),
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureCompensation"),
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("ExternalFlashExposureComp"),
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureBracketValue"),
                JAVA_BYTE.withName("FlashMode"),
                JAVA_BYTE.withName("FlashExposureCompensation2"),
                JAVA_BYTE.withName("FlashExposureCompensation3"),
                JAVA_BYTE.withName("FlashExposureCompensation4"),
                JAVA_BYTE.withName("FlashSource"),
                MemoryLayout.sequenceLayout(2, JAVA_BYTE).withName("FlashFirmware"),
                JAVA_BYTE.withName("ExternalFlashFlags"),
                JAVA_BYTE.withName("FlashControlCommanderMode"),
                JAVA_BYTE.withName("FlashOutputAndCompensation"),
                JAVA_BYTE.withName("FlashFocalLength"),
                JAVA_BYTE.withName("FlashGNDistance"),
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupControlMode"),
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupOutputAndCompensation"),
                JAVA_BYTE.withName("FlashColorFilter"),
                MemoryLayout.paddingLayout(1),
                JAVA_SHORT.withName("NEFCompression"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("ExposureMode"),
                JAVA_INT.withName("ExposureProgram"),
                JAVA_INT.withName("nMEshots"),
                JAVA_INT.withName("MEgainOn"),
                MemoryLayout.paddingLayout(4),
                MemoryLayout.sequenceLayout(4, JAVA_DOUBLE).withName("ME_WB"),
                JAVA_BYTE.withName("AFFineTune"),
                JAVA_BYTE.withName("AFFineTuneIndex"),
                JAVA_BYTE.withName("AFFineTuneAdj"),
                MemoryLayout.paddingLayout(1),
                JAVA_INT.withName("LensDataVersion"),
                JAVA_INT.withName("FlashInfoVersion"),
                JAVA_INT.withName("ColorBalanceVersion"),
                JAVA_BYTE.withName("key"),
                MemoryLayout.paddingLayout(1),
                MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("NEFBitDepth"),
                JAVA_SHORT.withName("HighSpeedCropFormat"),
                MemoryLayout.structLayout(
                    JAVA_SHORT.withName("cleft"),
                    JAVA_SHORT.withName("ctop"),
                    JAVA_SHORT.withName("cwidth"),
                    JAVA_SHORT.withName("cheight")
                ).withName("SensorHighSpeedCrop"),
                JAVA_SHORT.withName("SensorWidth"),
                JAVA_SHORT.withName("SensorHeight"),
                JAVA_SHORT.withName("Active_D_Lighting"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("ShotInfoVersion"),
                JAVA_SHORT.withName("MakernotesFlip"),
                MemoryLayout.paddingLayout(6),
                JAVA_DOUBLE.withName("RollAngle"),
                JAVA_DOUBLE.withName("PitchAngle"),
                JAVA_DOUBLE.withName("YawAngle")
            ).withName("nikon"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("BaseISO"),
                MemoryLayout.paddingLayout(4),
                JAVA_DOUBLE.withName("Gain"),
                MemoryLayout.sequenceLayout(8, JAVA_BYTE).withName("Sensor"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SensorUnit"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("HostBody"),
                JAVA_INT.withName("SensorCode"),
                JAVA_INT.withName("SensorSubCode"),
                JAVA_INT.withName("CoatingCode"),
                JAVA_INT.withName("uncropped"),
                MemoryLayout.sequenceLayout(32, JAVA_BYTE).withName("CaptureSequenceInitiator"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SensorUnitConnector"),
                JAVA_INT.withName("format"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("nIFD_CM"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("RecommendedCrop"),
                MemoryLayout.paddingLayout(4),
                MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_DOUBLE)).withName("mnColorMatrix")
            ).withName("hasselblad"),
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("ExpoMidPointShift"),
                JAVA_SHORT.withName("DynamicRange"),
                JAVA_SHORT.withName("FilmMode"),
                JAVA_SHORT.withName("DynamicRangeSetting"),
                JAVA_SHORT.withName("DevelopmentDynamicRange"),
                JAVA_SHORT.withName("AutoDynamicRange"),
                JAVA_SHORT.withName("DRangePriority"),
                JAVA_SHORT.withName("DRangePriorityAuto"),
                JAVA_SHORT.withName("DRangePriorityFixed"),
                JAVA_FLOAT.withName("BrightnessCompensation"),
                JAVA_SHORT.withName("FocusMode"),
                JAVA_SHORT.withName("AFMode"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusPixel"),
                JAVA_SHORT.withName("PrioritySettings"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("FocusSettings"),
                JAVA_INT.withName("AF_C_Settings"),
                JAVA_SHORT.withName("FocusWarning"),
                MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("ImageStabilization"),
                JAVA_SHORT.withName("FlashMode"),
                JAVA_SHORT.withName("WB_Preset"),
                JAVA_SHORT.withName("ShutterType"),
                JAVA_SHORT.withName("ExrMode"),
                JAVA_SHORT.withName("Macro"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("Rating"),
                JAVA_SHORT.withName("CropMode"),
                MemoryLayout.sequenceLayout(13, JAVA_BYTE).withName("SerialSignature"),
                MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("SensorID"),
                MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("RAFVersion"),
                MemoryLayout.paddingLayout(3),
                JAVA_INT.withName("RAFDataGeneration"),
                JAVA_SHORT.withName("RAFDataVersion"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("isTSNERDTS"),
                JAVA_SHORT.withName("DriveMode"),
                MemoryLayout.sequenceLayout(9, JAVA_SHORT).withName("BlackLevel"),
                MemoryLayout.sequenceLayout(32, JAVA_INT).withName("RAFData_ImageSizeTable"),
                JAVA_INT.withName("AutoBracketing"),
                JAVA_INT.withName("SequenceNumber"),
                JAVA_INT.withName("SeriesLength"),
                MemoryLayout.sequenceLayout(2, JAVA_FLOAT).withName("PixelShiftOffset"),
                JAVA_INT.withName("ImageCount")
            ).withName("fuji"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(6, JAVA_BYTE).withName("CameraType2"),
                JAVA_SHORT.withName("ValidBits"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("SensorCalibration"),
                MemoryLayout.sequenceLayout(5, JAVA_SHORT).withName("DriveMode"),
                JAVA_SHORT.withName("ColorSpace"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusMode"),
                JAVA_SHORT.withName("AutoFocus"),
                JAVA_SHORT.withName("AFPoint"),
                MemoryLayout.sequenceLayout(64, JAVA_INT).withName("AFAreas"),
                MemoryLayout.paddingLayout(4),
                MemoryLayout.sequenceLayout(5, JAVA_DOUBLE).withName("AFPointSelected"),
                JAVA_SHORT.withName("AFResult"),
                JAVA_BYTE.withName("AFFineTune"),
                MemoryLayout.paddingLayout(1),
                MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("AFFineTuneAdj"),
                MemoryLayout.paddingLayout(2),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("SpecialMode"),
                JAVA_SHORT.withName("ZoomStepCount"),
                JAVA_SHORT.withName("FocusStepCount"),
                JAVA_SHORT.withName("FocusStepInfinity"),
                JAVA_SHORT.withName("FocusStepNear"),
                JAVA_DOUBLE.withName("FocusDistance"),
                MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("AspectFrame"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("StackedImage"),
                JAVA_BYTE.withName("isLiveND"),
                MemoryLayout.paddingLayout(3),
                JAVA_INT.withName("LiveNDfactor"),
                JAVA_SHORT.withName("Panorama_mode"),
                JAVA_SHORT.withName("Panorama_frameNum"),
                MemoryLayout.paddingLayout(4)
            ).withName("olympus"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("CameraType"),
                JAVA_BYTE.withName("Sony0x9400_version"),
                JAVA_BYTE.withName("Sony0x9400_ReleaseMode2"),
                JAVA_INT.withName("Sony0x9400_SequenceImageNumber"),
                JAVA_BYTE.withName("Sony0x9400_SequenceLength1"),
                MemoryLayout.paddingLayout(3),
                JAVA_INT.withName("Sony0x9400_SequenceFileNumber"),
                JAVA_BYTE.withName("Sony0x9400_SequenceLength2"),
                JAVA_BYTE.withName("AFAreaModeSetting"),
                JAVA_SHORT.withName("AFAreaMode"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FlexibleSpotPosition"),
                JAVA_BYTE.withName("AFPointSelected"),
                JAVA_BYTE.withName("AFPointSelected_0x201e"),
                JAVA_SHORT.withName("nAFPointsUsed"),
                MemoryLayout.sequenceLayout(10, JAVA_BYTE).withName("AFPointsUsed"),
                JAVA_BYTE.withName("AFTracking"),
                JAVA_BYTE.withName("AFType"),
                MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("FocusLocation"),
                JAVA_SHORT.withName("FocusPosition"),
                JAVA_BYTE.withName("AFMicroAdjValue"),
                JAVA_BYTE.withName("AFMicroAdjOn"),
                JAVA_BYTE.withName("AFMicroAdjRegisteredLenses"),
                MemoryLayout.paddingLayout(1),
                JAVA_SHORT.withName("VariableLowPassFilter"),
                JAVA_INT.withName("LongExposureNoiseReduction"),
                JAVA_SHORT.withName("HighISONoiseReduction"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("HDR"),
                JAVA_SHORT.withName("group2010"),
                JAVA_SHORT.withName("group9050"),
                JAVA_SHORT.withName("real_iso_offset"),
                JAVA_SHORT.withName("MeteringMode_offset"),
                JAVA_SHORT.withName("ExposureProgram_offset"),
                JAVA_SHORT.withName("ReleaseMode2_offset"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("MinoltaCamID"),
                JAVA_FLOAT.withName("firmware"),
                JAVA_SHORT.withName("ImageCount3_offset"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("ImageCount3"),
                JAVA_INT.withName("ElectronicFrontCurtainShutter"),
                JAVA_SHORT.withName("MeteringMode2"),
                MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("SonyDateTime"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("ShotNumberSincePowerUp"),
                JAVA_SHORT.withName("PixelShiftGroupPrefix"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("PixelShiftGroupID"),
                JAVA_BYTE.withName("nShotsInPixelShiftGroup"),
                JAVA_BYTE.withName("numInPixelShiftGroup"),
                JAVA_SHORT.withName("prd_ImageHeight"),
                JAVA_SHORT.withName("prd_ImageWidth"),
                JAVA_SHORT.withName("prd_Total_bps"),
                JAVA_SHORT.withName("prd_Active_bps"),
                JAVA_SHORT.withName("prd_StorageMethod"),
                JAVA_SHORT.withName("prd_BayerPattern"),
                JAVA_SHORT.withName("SonyRawFileType"),
                JAVA_SHORT.withName("RAWFileType"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("Quality"),
                JAVA_SHORT.withName("FileFormat"),
                MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("MetaVersion"),
                MemoryLayout.paddingLayout(2)
            ).withName("sony"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("BlackLevelTop"),
                JAVA_SHORT.withName("BlackLevelBottom"),
                JAVA_SHORT.withName("offset_left"),
                JAVA_SHORT.withName("offset_top"),
                JAVA_SHORT.withName("clipBlack"),
                JAVA_SHORT.withName("clipWhite"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camDaylight"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camTungsten"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camFluorescent"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camFlash"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camCustom"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camAuto"),
                JAVA_SHORT.withName("val018percent"),
                JAVA_SHORT.withName("val100percent"),
                JAVA_SHORT.withName("val170percent"),
                JAVA_SHORT.withName("MakerNoteKodak8a"),
                JAVA_FLOAT.withName("ISOCalibrationGain"),
                JAVA_FLOAT.withName("AnalogISO")
            ).withName("kodak"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("Compression"),
                JAVA_SHORT.withName("BlackLevelDim"),
                MemoryLayout.sequenceLayout(8, JAVA_FLOAT).withName("BlackLevel"),
                JAVA_INT.withName("Multishot"),
                JAVA_FLOAT.withName("gamma"),
                MemoryLayout.sequenceLayout(3, JAVA_INT).withName("HighISOMultiplier"),
                JAVA_SHORT.withName("FocusStepNear"),
                JAVA_SHORT.withName("FocusStepCount"),
                JAVA_INT.withName("ZoomPosition"),
                JAVA_INT.withName("LensManufacturer")
            ).withName("panasonic"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("DriveMode"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusMode"),
                MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("AFPointSelected"),
                JAVA_SHORT.withName("AFPointSelected_Area"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("AFPointsInFocus_version"),
                JAVA_INT.withName("AFPointsInFocus"),
                JAVA_SHORT.withName("FocusPosition"),
                JAVA_SHORT.withName("AFAdjustment"),
                JAVA_BYTE.withName("AFPointMode"),
                JAVA_BYTE.withName("MultiExposure"),
                JAVA_SHORT.withName("Quality")
            ).withName("pentax"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("Software"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemType"),
                MemoryLayout.sequenceLayout(256, JAVA_BYTE).withName("FirmwareString"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemModel")
            ).withName("phaseone"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("AFStatus"),
                MemoryLayout.paddingLayout(2),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("AFAreaXPosition"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("AFAreaYPosition"),
                JAVA_SHORT.withName("AFAreaMode"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("SensorWidth"),
                JAVA_INT.withName("SensorHeight"),
                JAVA_INT.withName("CroppedImageWidth"),
                JAVA_INT.withName("CroppedImageHeight"),
                JAVA_SHORT.withName("WideAdapter"),
                JAVA_SHORT.withName("CropMode"),
                JAVA_SHORT.withName("NDFilter"),
                JAVA_SHORT.withName("AutoBracketing"),
                JAVA_SHORT.withName("MacroMode"),
                JAVA_SHORT.withName("FlashMode"),
                MemoryLayout.paddingLayout(4),
                JAVA_DOUBLE.withName("FlashExposureComp"),
                JAVA_DOUBLE.withName("ManualFlashOutput")
            ).withName("ricoh"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ImageSizeFull"),
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ImageSizeCrop"),
                MemoryLayout.sequenceLayout(2, JAVA_INT).withName("ColorSpace"),
                MemoryLayout.sequenceLayout(11, JAVA_INT).withName("key"),
                MemoryLayout.paddingLayout(4),
                JAVA_DOUBLE.withName("DigitalGain"),
                JAVA_INT.withName("DeviceType"),
                MemoryLayout.sequenceLayout(32, JAVA_BYTE).withName("LensFirmware"),
                MemoryLayout.paddingLayout(4)
            ).withName("samsung"),
            MemoryLayout.structLayout(
                JAVA_FLOAT.withName("FlashEC"),
                JAVA_FLOAT.withName("FlashGN"),
                JAVA_FLOAT.withName("CameraTemperature"),
                JAVA_FLOAT.withName("SensorTemperature"),
                JAVA_FLOAT.withName("SensorTemperature2"),
                JAVA_FLOAT.withName("LensTemperature"),
                JAVA_FLOAT.withName("AmbientTemperature"),
                JAVA_FLOAT.withName("BatteryTemperature"),
                JAVA_FLOAT.withName("exifAmbientTemperature"),
                JAVA_FLOAT.withName("exifHumidity"),
                JAVA_FLOAT.withName("exifPressure"),
                JAVA_FLOAT.withName("exifWaterDepth"),
                JAVA_FLOAT.withName("exifAcceleration"),
                JAVA_FLOAT.withName("exifCameraElevationAngle"),
                JAVA_FLOAT.withName("real_ISO"),
                JAVA_FLOAT.withName("exifExposureIndex"),
                JAVA_SHORT.withName("ColorSpace"),
                MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("firmware"),
                MemoryLayout.paddingLayout(2),
                JAVA_FLOAT.withName("ExposureCalibrationShift"),
                MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
                    JAVA_INT.withName("AFInfoData_tag"),
                    JAVA_SHORT.withName("AFInfoData_order"),
                    MemoryLayout.paddingLayout(2),
                    JAVA_INT.withName("AFInfoData_version"),
                    JAVA_INT.withName("AFInfoData_length"),
                    RuntimeHelper.POINTER.withName("AFInfoData")
                ).withName("libraw_afinfo_item_t")).withName("afdata"),
                JAVA_INT.withName("afcount"),
                MemoryLayout.paddingLayout(4)
            ).withName("common")
        ).withName("makernotes"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("DriveMode"),
            JAVA_SHORT.withName("FocusMode"),
            JAVA_SHORT.withName("MeteringMode"),
            JAVA_SHORT.withName("AFPoint"),
            JAVA_SHORT.withName("ExposureMode"),
            JAVA_SHORT.withName("ExposureProgram"),
            JAVA_SHORT.withName("ImageStabilization"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("BodySerial"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("InternalBodySerial")
        ).withName("shootinginfo"),
        MemoryLayout.paddingLayout(2),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("greybox"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("cropbox"),
            MemoryLayout.sequenceLayout(4, JAVA_DOUBLE).withName("aber"),
            MemoryLayout.sequenceLayout(6, JAVA_DOUBLE).withName("gamm"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("user_mul"),
            JAVA_FLOAT.withName("bright"),
            JAVA_FLOAT.withName("threshold"),
            JAVA_INT.withName("half_size"),
            JAVA_INT.withName("four_color_rgb"),
            JAVA_INT.withName("highlight"),
            JAVA_INT.withName("use_auto_wb"),
            JAVA_INT.withName("use_camera_wb"),
            JAVA_INT.withName("use_camera_matrix"),
            JAVA_INT.withName("output_color"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("output_profile"),
            RuntimeHelper.POINTER.withName("camera_profile"),
            RuntimeHelper.POINTER.withName("bad_pixels"),
            RuntimeHelper.POINTER.withName("dark_frame"),
            JAVA_INT.withName("output_bps"),
            JAVA_INT.withName("output_tiff"),
            JAVA_INT.withName("output_flags"),
            JAVA_INT.withName("user_flip"),
            JAVA_INT.withName("user_qual"),
            JAVA_INT.withName("user_black"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("user_cblack"),
            JAVA_INT.withName("user_sat"),
            JAVA_INT.withName("med_passes"),
            JAVA_FLOAT.withName("auto_bright_thr"),
            JAVA_FLOAT.withName("adjust_maximum_thr"),
            JAVA_INT.withName("no_auto_bright"),
            JAVA_INT.withName("use_fuji_rotate"),
            JAVA_INT.withName("green_matching"),
            JAVA_INT.withName("dcb_iterations"),
            JAVA_INT.withName("dcb_enhance_fl"),
            JAVA_INT.withName("fbdd_noiserd"),
            JAVA_INT.withName("exp_correc"),
            JAVA_FLOAT.withName("exp_shift"),
            JAVA_FLOAT.withName("exp_preser"),
            JAVA_INT.withName("no_auto_scale"),
            JAVA_INT.withName("no_interpolation"),
            MemoryLayout.paddingLayout(4)
        ).withName("params"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("use_rawspeed"),
            JAVA_INT.withName("use_dngsdk"),
            JAVA_INT.withName("options"),
            JAVA_INT.withName("shot_select"),
            JAVA_INT.withName("specials"),
            JAVA_INT.withName("max_raw_memory_mb"),
            JAVA_INT.withName("sony_arw2_posterization_thr"),
            JAVA_FLOAT.withName("coolscan_nef_gamma"),
            MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("p4shot_order"),
            MemoryLayout.paddingLayout(3),
            RuntimeHelper.POINTER.withName("custom_camera_strings")
        ).withName("rawparams"),
        JAVA_INT.withName("progress_flags"),
        JAVA_INT.withName("process_warnings"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(65536, JAVA_SHORT).withName("curve"),
            MemoryLayout.sequenceLayout(4104, JAVA_INT).withName("cblack"),
            JAVA_INT.withName("black"),
            JAVA_INT.withName("data_maximum"),
            JAVA_INT.withName("maximum"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("linear_max"),
            JAVA_FLOAT.withName("fmaximum"),
            JAVA_FLOAT.withName("fnorm"),
            MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(8, JAVA_SHORT)).withName("white"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("cam_mul"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("pre_mul"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("cmatrix"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("ccm"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("rgb_cam"),
            MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("cam_xyz"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("format"),
                JAVA_INT.withName("key_off"),
                JAVA_INT.withName("tag_21a"),
                JAVA_INT.withName("t_black"),
                JAVA_INT.withName("split_col"),
                JAVA_INT.withName("black_col"),
                JAVA_INT.withName("split_row"),
                JAVA_INT.withName("black_row"),
                JAVA_FLOAT.withName("tag_210")
            ).withName("phase_one_data"),
            JAVA_FLOAT.withName("flash_used"),
            JAVA_FLOAT.withName("canon_ev"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("model2"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("UniqueCameraModel"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("LocalizedCameraModel"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("ImageUniqueID"),
            MemoryLayout.sequenceLayout(17, JAVA_BYTE).withName("RawDataUniqueID"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("OriginalRawFileName"),
            MemoryLayout.paddingLayout(7),
            RuntimeHelper.POINTER.withName("profile"),
            JAVA_INT.withName("profile_length"),
            MemoryLayout.sequenceLayout(8, JAVA_INT).withName("black_stat"),
            MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                JAVA_INT.withName("parsedfields"),
                JAVA_SHORT.withName("illuminant"),
                MemoryLayout.paddingLayout(2),
                MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("calibration"),
                MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("colormatrix"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("forwardmatrix")
            ).withName("libraw_dng_color_t")).withName("dng_color"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("parsedfields"),
                MemoryLayout.sequenceLayout(4104, JAVA_INT).withName("dng_cblack"),
                JAVA_INT.withName("dng_black"),
                MemoryLayout.sequenceLayout(4104, JAVA_FLOAT).withName("dng_fcblack"),
                JAVA_FLOAT.withName("dng_fblack"),
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("dng_whitelevel"),
                MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("default_crop"),
                MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("user_crop"),
                JAVA_INT.withName("preview_colorspace"),
                MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("analogbalance"),
                MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("asshotneutral"),
                JAVA_FLOAT.withName("baseline_exposure"),
                JAVA_FLOAT.withName("LinearResponseLimit")
            ).withName("dng_levels"),
            MemoryLayout.sequenceLayout(256, MemoryLayout.sequenceLayout(4, JAVA_INT)).withName("WB_Coeffs"),
            MemoryLayout.sequenceLayout(64, MemoryLayout.sequenceLayout(5, JAVA_FLOAT)).withName("WBCT_Coeffs"),
            JAVA_INT.withName("as_shot_wb_applied"),
            MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(9, JAVA_FLOAT).withName("romm_cam")
            ).withName("libraw_P1_color_t")).withName("P1_color"),
            JAVA_INT.withName("raw_bps"),
            JAVA_INT.withName("ExifColorSpace")
        ).withName("color"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("iso_speed"),
            JAVA_FLOAT.withName("shutter"),
            JAVA_FLOAT.withName("aperture"),
            JAVA_FLOAT.withName("focal_len"),
            JAVA_LONG.withName("timestamp"),
            JAVA_INT.withName("shot_order"),
            MemoryLayout.sequenceLayout(32, JAVA_INT).withName("gpsdata"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(3, JAVA_FLOAT).withName("latitude"),
                MemoryLayout.sequenceLayout(3, JAVA_FLOAT).withName("longitude"),
                MemoryLayout.sequenceLayout(3, JAVA_FLOAT).withName("gpstimestamp"),
                JAVA_FLOAT.withName("altitude"),
                JAVA_BYTE.withName("altref"),
                JAVA_BYTE.withName("latref"),
                JAVA_BYTE.withName("longref"),
                JAVA_BYTE.withName("gpsstatus"),
                JAVA_BYTE.withName("gpsparsed"),
                MemoryLayout.paddingLayout(3)
            ).withName("parsed_gps"),
            MemoryLayout.sequenceLayout(512, JAVA_BYTE).withName("desc"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("artist"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("analogbalance"),
            MemoryLayout.paddingLayout(4)
        ).withName("other"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("tformat"),
            JAVA_SHORT.withName("twidth"),
            JAVA_SHORT.withName("theight"),
            JAVA_INT.withName("tlength"),
            JAVA_INT.withName("tcolors"),
            RuntimeHelper.POINTER.withName("thumb")
        ).withName("thumbnail"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("raw_alloc"),
            RuntimeHelper.POINTER.withName("raw_image"),
            RuntimeHelper.POINTER.withName("color4_image"),
            RuntimeHelper.POINTER.withName("color3_image"),
            RuntimeHelper.POINTER.withName("float_image"),
            RuntimeHelper.POINTER.withName("float3_image"),
            RuntimeHelper.POINTER.withName("float4_image"),
            RuntimeHelper.POINTER.withName("ph1_cblack"),
            RuntimeHelper.POINTER.withName("ph1_rblack"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("guard"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("make"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("model"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("software"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("normalized_make"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("normalized_model"),
                JAVA_INT.withName("maker_index"),
                JAVA_INT.withName("raw_count"),
                JAVA_INT.withName("dng_version"),
                JAVA_INT.withName("is_foveon"),
                JAVA_INT.withName("colors"),
                JAVA_INT.withName("filters"),
                MemoryLayout.sequenceLayout(6, MemoryLayout.sequenceLayout(6, JAVA_BYTE)).withName("xtrans"),
                MemoryLayout.sequenceLayout(6, MemoryLayout.sequenceLayout(6, JAVA_BYTE)).withName("xtrans_abs"),
                MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("cdesc"),
                MemoryLayout.paddingLayout(3),
                JAVA_INT.withName("xmplen"),
                RuntimeHelper.POINTER.withName("xmpdata")
            ).withName("iparams"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("raw_height"),
                JAVA_SHORT.withName("raw_width"),
                JAVA_SHORT.withName("height"),
                JAVA_SHORT.withName("width"),
                JAVA_SHORT.withName("top_margin"),
                JAVA_SHORT.withName("left_margin"),
                JAVA_SHORT.withName("iheight"),
                JAVA_SHORT.withName("iwidth"),
                JAVA_INT.withName("raw_pitch"),
                MemoryLayout.paddingLayout(4),
                JAVA_DOUBLE.withName("pixel_aspect"),
                JAVA_INT.withName("flip"),
                MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(4, JAVA_INT)).withName("mask"),
                JAVA_SHORT.withName("raw_aspect"),
                MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                    JAVA_SHORT.withName("cleft"),
                    JAVA_SHORT.withName("ctop"),
                    JAVA_SHORT.withName("cwidth"),
                    JAVA_SHORT.withName("cheight")
                ).withName("libraw_raw_inset_crop_t")).withName("raw_inset_crops"),
                MemoryLayout.paddingLayout(2)
            ).withName("sizes"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("mix_green"),
                JAVA_INT.withName("raw_color"),
                JAVA_INT.withName("zero_is_bad"),
                JAVA_SHORT.withName("shrink"),
                JAVA_SHORT.withName("fuji_width")
            ).withName("ioparams"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(65536, JAVA_SHORT).withName("curve"),
                MemoryLayout.sequenceLayout(4104, JAVA_INT).withName("cblack"),
                JAVA_INT.withName("black"),
                JAVA_INT.withName("data_maximum"),
                JAVA_INT.withName("maximum"),
                MemoryLayout.sequenceLayout(4, JAVA_INT).withName("linear_max"),
                JAVA_FLOAT.withName("fmaximum"),
                JAVA_FLOAT.withName("fnorm"),
                MemoryLayout.sequenceLayout(8, MemoryLayout.sequenceLayout(8, JAVA_SHORT)).withName("white"),
                MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("cam_mul"),
                MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("pre_mul"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("cmatrix"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("ccm"),
                MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("rgb_cam"),
                MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("cam_xyz"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("format"),
                    JAVA_INT.withName("key_off"),
                    JAVA_INT.withName("tag_21a"),
                    JAVA_INT.withName("t_black"),
                    JAVA_INT.withName("split_col"),
                    JAVA_INT.withName("black_col"),
                    JAVA_INT.withName("split_row"),
                    JAVA_INT.withName("black_row"),
                    JAVA_FLOAT.withName("tag_210")
                ).withName("phase_one_data"),
                JAVA_FLOAT.withName("flash_used"),
                JAVA_FLOAT.withName("canon_ev"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("model2"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("UniqueCameraModel"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("LocalizedCameraModel"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("ImageUniqueID"),
                MemoryLayout.sequenceLayout(17, JAVA_BYTE).withName("RawDataUniqueID"),
                MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("OriginalRawFileName"),
                MemoryLayout.paddingLayout(7),
                RuntimeHelper.POINTER.withName("profile"),
                JAVA_INT.withName("profile_length"),
                MemoryLayout.sequenceLayout(8, JAVA_INT).withName("black_stat"),
                MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                    JAVA_INT.withName("parsedfields"),
                    JAVA_SHORT.withName("illuminant"),
                    MemoryLayout.paddingLayout(2),
                    MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("calibration"),
                    MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("colormatrix"),
                    MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(4, JAVA_FLOAT)).withName("forwardmatrix")
                ).withName("libraw_dng_color_t")).withName("dng_color"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("parsedfields"),
                    MemoryLayout.sequenceLayout(4104, JAVA_INT).withName("dng_cblack"),
                    JAVA_INT.withName("dng_black"),
                    MemoryLayout.sequenceLayout(4104, JAVA_FLOAT).withName("dng_fcblack"),
                    JAVA_FLOAT.withName("dng_fblack"),
                    MemoryLayout.sequenceLayout(4, JAVA_INT).withName("dng_whitelevel"),
