// Generated by jextract

package org.libraw.linuxosx;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$33 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$33() {}
    static final VarHandle const$0 = constants$32.const$4.varHandle(MemoryLayout.PathElement.groupElement("ctop"));
    static final VarHandle const$1 = constants$32.const$4.varHandle(MemoryLayout.PathElement.groupElement("cwidth"));
    static final VarHandle const$2 = constants$32.const$4.varHandle(MemoryLayout.PathElement.groupElement("cheight"));
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_DOUBLE.withName("ExposureBracketValue"),
        JAVA_SHORT.withName("ActiveDLighting"),
        JAVA_SHORT.withName("ShootingMode"),
        MemoryLayout.sequenceLayout(7, JAVA_BYTE).withName("ImageStabilization"),
        JAVA_BYTE.withName("VibrationReduction"),
        JAVA_BYTE.withName("VRMode"),
        MemoryLayout.sequenceLayout(13, JAVA_BYTE).withName("FlashSetting"),
        MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("FlashType"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureCompensation"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("ExternalFlashExposureComp"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureBracketValue"),
        JAVA_BYTE.withName("FlashMode"),
        JAVA_BYTE.withName("FlashExposureCompensation2"),
        JAVA_BYTE.withName("FlashExposureCompensation3"),
        JAVA_BYTE.withName("FlashExposureCompensation4"),
        JAVA_BYTE.withName("FlashSource"),
        MemoryLayout.sequenceLayout(2, JAVA_BYTE).withName("FlashFirmware"),
        JAVA_BYTE.withName("ExternalFlashFlags"),
        JAVA_BYTE.withName("FlashControlCommanderMode"),
        JAVA_BYTE.withName("FlashOutputAndCompensation"),
        JAVA_BYTE.withName("FlashFocalLength"),
        JAVA_BYTE.withName("FlashGNDistance"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupControlMode"),
        MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupOutputAndCompensation"),
        JAVA_BYTE.withName("FlashColorFilter"),
        MemoryLayout.paddingLayout(1),
        JAVA_SHORT.withName("NEFCompression"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("ExposureMode"),
        JAVA_INT.withName("ExposureProgram"),
        JAVA_INT.withName("nMEshots"),
        JAVA_INT.withName("MEgainOn"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(4, JAVA_DOUBLE).withName("ME_WB"),
        JAVA_BYTE.withName("AFFineTune"),
        JAVA_BYTE.withName("AFFineTuneIndex"),
        JAVA_BYTE.withName("AFFineTuneAdj"),
        MemoryLayout.paddingLayout(1),
        JAVA_INT.withName("LensDataVersion"),
        JAVA_INT.withName("FlashInfoVersion"),
        JAVA_INT.withName("ColorBalanceVersion"),
        JAVA_BYTE.withName("key"),
        MemoryLayout.paddingLayout(1),
        MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("NEFBitDepth"),
        JAVA_SHORT.withName("HighSpeedCropFormat"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("cleft"),
            JAVA_SHORT.withName("ctop"),
            JAVA_SHORT.withName("cwidth"),
            JAVA_SHORT.withName("cheight")
        ).withName("SensorHighSpeedCrop"),
        JAVA_SHORT.withName("SensorWidth"),
        JAVA_SHORT.withName("SensorHeight"),
        JAVA_SHORT.withName("Active_D_Lighting"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("ShotInfoVersion"),
        JAVA_SHORT.withName("MakernotesFlip"),
        MemoryLayout.paddingLayout(6),
        JAVA_DOUBLE.withName("RollAngle"),
        JAVA_DOUBLE.withName("PitchAngle"),
        JAVA_DOUBLE.withName("YawAngle")
    ).withName("libraw_nikon_makernotes_t");
    static final VarHandle const$4 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("ExposureBracketValue"));
    static final VarHandle const$5 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("ActiveDLighting"));
}


