// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$39 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$39() {}
    static final VarHandle const$0 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("ShotInfoVersion"));
    static final VarHandle const$1 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("MakernotesFlip"));
    static final VarHandle const$2 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("RollAngle"));
    static final VarHandle const$3 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("PitchAngle"));
    static final VarHandle const$4 = constants$33.const$3.varHandle(MemoryLayout.PathElement.groupElement("YawAngle"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(6, JAVA_BYTE).withName("CameraType2"),
        JAVA_SHORT.withName("ValidBits"),
        MemoryLayout.sequenceLayout(2, JAVA_INT).withName("SensorCalibration"),
        MemoryLayout.sequenceLayout(5, JAVA_SHORT).withName("DriveMode"),
        JAVA_SHORT.withName("ColorSpace"),
        MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusMode"),
        JAVA_SHORT.withName("AutoFocus"),
        JAVA_SHORT.withName("AFPoint"),
        MemoryLayout.sequenceLayout(64, JAVA_INT).withName("AFAreas"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(5, JAVA_DOUBLE).withName("AFPointSelected"),
        JAVA_SHORT.withName("AFResult"),
        JAVA_BYTE.withName("AFFineTune"),
        MemoryLayout.paddingLayout(1),
        MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("AFFineTuneAdj"),
        MemoryLayout.paddingLayout(2),
        MemoryLayout.sequenceLayout(3, JAVA_INT).withName("SpecialMode"),
        JAVA_SHORT.withName("ZoomStepCount"),
        JAVA_SHORT.withName("FocusStepCount"),
        JAVA_SHORT.withName("FocusStepInfinity"),
        JAVA_SHORT.withName("FocusStepNear"),
        JAVA_DOUBLE.withName("FocusDistance"),
        MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("AspectFrame"),
        MemoryLayout.sequenceLayout(2, JAVA_INT).withName("StackedImage"),
        JAVA_BYTE.withName("isLiveND"),
        MemoryLayout.paddingLayout(3),
        JAVA_INT.withName("LiveNDfactor"),
        JAVA_SHORT.withName("Panorama_mode"),
        JAVA_SHORT.withName("Panorama_frameNum"),
        MemoryLayout.paddingLayout(4)
    ).withName("libraw_olympus_makernotes_t");
}


