// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$50 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$50() {}
    static final VarHandle const$0 = constants$48.const$3.varHandle(MemoryLayout.PathElement.groupElement("val170percent"));
    static final VarHandle const$1 = constants$48.const$3.varHandle(MemoryLayout.PathElement.groupElement("MakerNoteKodak8a"));
    static final VarHandle const$2 = constants$48.const$3.varHandle(MemoryLayout.PathElement.groupElement("ISOCalibrationGain"));
    static final VarHandle const$3 = constants$48.const$3.varHandle(MemoryLayout.PathElement.groupElement("AnalogISO"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("Software"),
        MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemType"),
        MemoryLayout.sequenceLayout(256, JAVA_BYTE).withName("FirmwareString"),
        MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemModel")
    ).withName("libraw_p1_makernotes_t");
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_SHORT.withName("CameraType"),
        JAVA_BYTE.withName("Sony0x9400_version"),
        JAVA_BYTE.withName("Sony0x9400_ReleaseMode2"),
        JAVA_INT.withName("Sony0x9400_SequenceImageNumber"),
        JAVA_BYTE.withName("Sony0x9400_SequenceLength1"),
        MemoryLayout.paddingLayout(3),
        JAVA_INT.withName("Sony0x9400_SequenceFileNumber"),
        JAVA_BYTE.withName("Sony0x9400_SequenceLength2"),
        JAVA_BYTE.withName("AFAreaModeSetting"),
        JAVA_SHORT.withName("AFAreaMode"),
        MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FlexibleSpotPosition"),
        JAVA_BYTE.withName("AFPointSelected"),
        JAVA_BYTE.withName("AFPointSelected_0x201e"),
        JAVA_SHORT.withName("nAFPointsUsed"),
        MemoryLayout.sequenceLayout(10, JAVA_BYTE).withName("AFPointsUsed"),
        JAVA_BYTE.withName("AFTracking"),
        JAVA_BYTE.withName("AFType"),
        MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("FocusLocation"),
        JAVA_SHORT.withName("FocusPosition"),
        JAVA_BYTE.withName("AFMicroAdjValue"),
        JAVA_BYTE.withName("AFMicroAdjOn"),
        JAVA_BYTE.withName("AFMicroAdjRegisteredLenses"),
        MemoryLayout.paddingLayout(1),
        JAVA_SHORT.withName("VariableLowPassFilter"),
        JAVA_INT.withName("LongExposureNoiseReduction"),
        JAVA_SHORT.withName("HighISONoiseReduction"),
        MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("HDR"),
        JAVA_SHORT.withName("group2010"),
        JAVA_SHORT.withName("group9050"),
        JAVA_SHORT.withName("real_iso_offset"),
        JAVA_SHORT.withName("MeteringMode_offset"),
        JAVA_SHORT.withName("ExposureProgram_offset"),
        JAVA_SHORT.withName("ReleaseMode2_offset"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("MinoltaCamID"),
        JAVA_FLOAT.withName("firmware"),
        JAVA_SHORT.withName("ImageCount3_offset"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("ImageCount3"),
        JAVA_INT.withName("ElectronicFrontCurtainShutter"),
        JAVA_SHORT.withName("MeteringMode2"),
        MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("SonyDateTime"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("ShotNumberSincePowerUp"),
        JAVA_SHORT.withName("PixelShiftGroupPrefix"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("PixelShiftGroupID"),
        JAVA_BYTE.withName("nShotsInPixelShiftGroup"),
        JAVA_BYTE.withName("numInPixelShiftGroup"),
        JAVA_SHORT.withName("prd_ImageHeight"),
        JAVA_SHORT.withName("prd_ImageWidth"),
        JAVA_SHORT.withName("prd_Total_bps"),
        JAVA_SHORT.withName("prd_Active_bps"),
        JAVA_SHORT.withName("prd_StorageMethod"),
        JAVA_SHORT.withName("prd_BayerPattern"),
        JAVA_SHORT.withName("SonyRawFileType"),
        JAVA_SHORT.withName("RAWFileType"),
        MemoryLayout.paddingLayout(2),
        JAVA_INT.withName("Quality"),
        JAVA_SHORT.withName("FileFormat"),
        MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("MetaVersion"),
        MemoryLayout.paddingLayout(2)
    ).withName("libraw_sony_info_t");
}


