// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$85 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$85() {}
    static final VarHandle const$0 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("MaxFocal"));
    static final VarHandle const$1 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("MaxAp4MinFocal"));
    static final VarHandle const$2 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("MaxAp4MaxFocal"));
    static final VarHandle const$3 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("EXIF_MaxAp"));
    static final VarHandle const$4 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("FocalLengthIn35mmFormat"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("ColorDataVer"),
            JAVA_INT.withName("ColorDataSubVer"),
            JAVA_INT.withName("SpecularWhiteLevel"),
            JAVA_INT.withName("NormalWhiteLevel"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ChannelBlackLevel"),
            JAVA_INT.withName("AverageBlackLevel"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("multishot"),
            JAVA_SHORT.withName("MeteringMode"),
            JAVA_SHORT.withName("SpotMeteringMode"),
            JAVA_BYTE.withName("FlashMeteringMode"),
            MemoryLayout.paddingLayout(1),
            JAVA_SHORT.withName("FlashExposureLock"),
            JAVA_SHORT.withName("ExposureMode"),
            JAVA_SHORT.withName("AESetting"),
            JAVA_SHORT.withName("ImageStabilization"),
            JAVA_SHORT.withName("FlashMode"),
            JAVA_SHORT.withName("FlashActivity"),
            JAVA_SHORT.withName("FlashBits"),
            JAVA_SHORT.withName("ManualFlashOutput"),
            JAVA_SHORT.withName("FlashOutput"),
            JAVA_SHORT.withName("FlashGuideNumber"),
            JAVA_SHORT.withName("ContinuousDrive"),
            JAVA_SHORT.withName("SensorWidth"),
            JAVA_SHORT.withName("SensorHeight"),
            JAVA_INT.withName("AFMicroAdjMode"),
            JAVA_FLOAT.withName("AFMicroAdjValue"),
            JAVA_SHORT.withName("MakernotesFlip"),
            JAVA_SHORT.withName("RecordMode"),
            JAVA_SHORT.withName("SRAWQuality"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("wbi"),
            JAVA_SHORT.withName("RF_lensID"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("AutoLightingOptimizer"),
            JAVA_INT.withName("HighlightTonePriority"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("t"),
                JAVA_SHORT.withName("l"),
                JAVA_SHORT.withName("b"),
                JAVA_SHORT.withName("r")
            ).withName("DefaultCropAbsolute"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("t"),
                JAVA_SHORT.withName("l"),
                JAVA_SHORT.withName("b"),
                JAVA_SHORT.withName("r")
            ).withName("RecommendedImageArea"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("t"),
                JAVA_SHORT.withName("l"),
                JAVA_SHORT.withName("b"),
                JAVA_SHORT.withName("r")
            ).withName("LeftOpticalBlack"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("t"),
                JAVA_SHORT.withName("l"),
                JAVA_SHORT.withName("b"),
                JAVA_SHORT.withName("r")
            ).withName("UpperOpticalBlack"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("t"),
                JAVA_SHORT.withName("l"),
                JAVA_SHORT.withName("b"),
                JAVA_SHORT.withName("r")
            ).withName("ActiveArea"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("ISOgain")
        ).withName("canon"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("ExposureBracketValue"),
            JAVA_SHORT.withName("ActiveDLighting"),
            JAVA_SHORT.withName("ShootingMode"),
            MemoryLayout.sequenceLayout(7, JAVA_BYTE).withName("ImageStabilization"),
            JAVA_BYTE.withName("VibrationReduction"),
            JAVA_BYTE.withName("VRMode"),
            MemoryLayout.sequenceLayout(13, JAVA_BYTE).withName("FlashSetting"),
            MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("FlashType"),
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureCompensation"),
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("ExternalFlashExposureComp"),
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashExposureBracketValue"),
            JAVA_BYTE.withName("FlashMode"),
            JAVA_BYTE.withName("FlashExposureCompensation2"),
            JAVA_BYTE.withName("FlashExposureCompensation3"),
            JAVA_BYTE.withName("FlashExposureCompensation4"),
            JAVA_BYTE.withName("FlashSource"),
            MemoryLayout.sequenceLayout(2, JAVA_BYTE).withName("FlashFirmware"),
            JAVA_BYTE.withName("ExternalFlashFlags"),
            JAVA_BYTE.withName("FlashControlCommanderMode"),
            JAVA_BYTE.withName("FlashOutputAndCompensation"),
            JAVA_BYTE.withName("FlashFocalLength"),
            JAVA_BYTE.withName("FlashGNDistance"),
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupControlMode"),
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("FlashGroupOutputAndCompensation"),
            JAVA_BYTE.withName("FlashColorFilter"),
            MemoryLayout.paddingLayout(1),
            JAVA_SHORT.withName("NEFCompression"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("ExposureMode"),
            JAVA_INT.withName("ExposureProgram"),
            JAVA_INT.withName("nMEshots"),
            JAVA_INT.withName("MEgainOn"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.sequenceLayout(4, JAVA_DOUBLE).withName("ME_WB"),
            JAVA_BYTE.withName("AFFineTune"),
            JAVA_BYTE.withName("AFFineTuneIndex"),
            JAVA_BYTE.withName("AFFineTuneAdj"),
            MemoryLayout.paddingLayout(1),
            JAVA_INT.withName("LensDataVersion"),
            JAVA_INT.withName("FlashInfoVersion"),
            JAVA_INT.withName("ColorBalanceVersion"),
            JAVA_BYTE.withName("key"),
            MemoryLayout.paddingLayout(1),
            MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("NEFBitDepth"),
            JAVA_SHORT.withName("HighSpeedCropFormat"),
            MemoryLayout.structLayout(
                JAVA_SHORT.withName("cleft"),
                JAVA_SHORT.withName("ctop"),
                JAVA_SHORT.withName("cwidth"),
                JAVA_SHORT.withName("cheight")
            ).withName("SensorHighSpeedCrop"),
            JAVA_SHORT.withName("SensorWidth"),
            JAVA_SHORT.withName("SensorHeight"),
            JAVA_SHORT.withName("Active_D_Lighting"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("ShotInfoVersion"),
            JAVA_SHORT.withName("MakernotesFlip"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("RollAngle"),
            JAVA_DOUBLE.withName("PitchAngle"),
            JAVA_DOUBLE.withName("YawAngle")
        ).withName("nikon"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("BaseISO"),
            MemoryLayout.paddingLayout(4),
            JAVA_DOUBLE.withName("Gain"),
            MemoryLayout.sequenceLayout(8, JAVA_BYTE).withName("Sensor"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SensorUnit"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("HostBody"),
            JAVA_INT.withName("SensorCode"),
            JAVA_INT.withName("SensorSubCode"),
            JAVA_INT.withName("CoatingCode"),
            JAVA_INT.withName("uncropped"),
            MemoryLayout.sequenceLayout(32, JAVA_BYTE).withName("CaptureSequenceInitiator"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SensorUnitConnector"),
            JAVA_INT.withName("format"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("nIFD_CM"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("RecommendedCrop"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, JAVA_DOUBLE)).withName("mnColorMatrix")
        ).withName("hasselblad"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("ExpoMidPointShift"),
            JAVA_SHORT.withName("DynamicRange"),
            JAVA_SHORT.withName("FilmMode"),
            JAVA_SHORT.withName("DynamicRangeSetting"),
            JAVA_SHORT.withName("DevelopmentDynamicRange"),
            JAVA_SHORT.withName("AutoDynamicRange"),
            JAVA_SHORT.withName("DRangePriority"),
            JAVA_SHORT.withName("DRangePriorityAuto"),
            JAVA_SHORT.withName("DRangePriorityFixed"),
            JAVA_FLOAT.withName("BrightnessCompensation"),
            JAVA_SHORT.withName("FocusMode"),
            JAVA_SHORT.withName("AFMode"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusPixel"),
            JAVA_SHORT.withName("PrioritySettings"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("FocusSettings"),
            JAVA_INT.withName("AF_C_Settings"),
            JAVA_SHORT.withName("FocusWarning"),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("ImageStabilization"),
            JAVA_SHORT.withName("FlashMode"),
            JAVA_SHORT.withName("WB_Preset"),
            JAVA_SHORT.withName("ShutterType"),
            JAVA_SHORT.withName("ExrMode"),
            JAVA_SHORT.withName("Macro"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("Rating"),
            JAVA_SHORT.withName("CropMode"),
            MemoryLayout.sequenceLayout(13, JAVA_BYTE).withName("SerialSignature"),
            MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("SensorID"),
            MemoryLayout.sequenceLayout(5, JAVA_BYTE).withName("RAFVersion"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("RAFDataGeneration"),
            JAVA_SHORT.withName("RAFDataVersion"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("isTSNERDTS"),
            JAVA_SHORT.withName("DriveMode"),
            MemoryLayout.sequenceLayout(9, JAVA_SHORT).withName("BlackLevel"),
            MemoryLayout.sequenceLayout(32, JAVA_INT).withName("RAFData_ImageSizeTable"),
            JAVA_INT.withName("AutoBracketing"),
            JAVA_INT.withName("SequenceNumber"),
            JAVA_INT.withName("SeriesLength"),
            MemoryLayout.sequenceLayout(2, JAVA_FLOAT).withName("PixelShiftOffset"),
            JAVA_INT.withName("ImageCount")
        ).withName("fuji"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(6, JAVA_BYTE).withName("CameraType2"),
            JAVA_SHORT.withName("ValidBits"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("SensorCalibration"),
            MemoryLayout.sequenceLayout(5, JAVA_SHORT).withName("DriveMode"),
            JAVA_SHORT.withName("ColorSpace"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusMode"),
            JAVA_SHORT.withName("AutoFocus"),
            JAVA_SHORT.withName("AFPoint"),
            MemoryLayout.sequenceLayout(64, JAVA_INT).withName("AFAreas"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.sequenceLayout(5, JAVA_DOUBLE).withName("AFPointSelected"),
            JAVA_SHORT.withName("AFResult"),
            JAVA_BYTE.withName("AFFineTune"),
            MemoryLayout.paddingLayout(1),
            MemoryLayout.sequenceLayout(3, JAVA_SHORT).withName("AFFineTuneAdj"),
            MemoryLayout.paddingLayout(2),
            MemoryLayout.sequenceLayout(3, JAVA_INT).withName("SpecialMode"),
            JAVA_SHORT.withName("ZoomStepCount"),
            JAVA_SHORT.withName("FocusStepCount"),
            JAVA_SHORT.withName("FocusStepInfinity"),
            JAVA_SHORT.withName("FocusStepNear"),
            JAVA_DOUBLE.withName("FocusDistance"),
            MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("AspectFrame"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("StackedImage"),
            JAVA_BYTE.withName("isLiveND"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("LiveNDfactor"),
            JAVA_SHORT.withName("Panorama_mode"),
            JAVA_SHORT.withName("Panorama_frameNum"),
            MemoryLayout.paddingLayout(4)
        ).withName("olympus"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("CameraType"),
            JAVA_BYTE.withName("Sony0x9400_version"),
            JAVA_BYTE.withName("Sony0x9400_ReleaseMode2"),
            JAVA_INT.withName("Sony0x9400_SequenceImageNumber"),
            JAVA_BYTE.withName("Sony0x9400_SequenceLength1"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("Sony0x9400_SequenceFileNumber"),
            JAVA_BYTE.withName("Sony0x9400_SequenceLength2"),
            JAVA_BYTE.withName("AFAreaModeSetting"),
            JAVA_SHORT.withName("AFAreaMode"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FlexibleSpotPosition"),
            JAVA_BYTE.withName("AFPointSelected"),
            JAVA_BYTE.withName("AFPointSelected_0x201e"),
            JAVA_SHORT.withName("nAFPointsUsed"),
            MemoryLayout.sequenceLayout(10, JAVA_BYTE).withName("AFPointsUsed"),
            JAVA_BYTE.withName("AFTracking"),
            JAVA_BYTE.withName("AFType"),
            MemoryLayout.sequenceLayout(4, JAVA_SHORT).withName("FocusLocation"),
            JAVA_SHORT.withName("FocusPosition"),
            JAVA_BYTE.withName("AFMicroAdjValue"),
            JAVA_BYTE.withName("AFMicroAdjOn"),
            JAVA_BYTE.withName("AFMicroAdjRegisteredLenses"),
            MemoryLayout.paddingLayout(1),
            JAVA_SHORT.withName("VariableLowPassFilter"),
            JAVA_INT.withName("LongExposureNoiseReduction"),
            JAVA_SHORT.withName("HighISONoiseReduction"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("HDR"),
            JAVA_SHORT.withName("group2010"),
            JAVA_SHORT.withName("group9050"),
            JAVA_SHORT.withName("real_iso_offset"),
            JAVA_SHORT.withName("MeteringMode_offset"),
            JAVA_SHORT.withName("ExposureProgram_offset"),
            JAVA_SHORT.withName("ReleaseMode2_offset"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("MinoltaCamID"),
            JAVA_FLOAT.withName("firmware"),
            JAVA_SHORT.withName("ImageCount3_offset"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("ImageCount3"),
            JAVA_INT.withName("ElectronicFrontCurtainShutter"),
            JAVA_SHORT.withName("MeteringMode2"),
            MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("SonyDateTime"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("ShotNumberSincePowerUp"),
            JAVA_SHORT.withName("PixelShiftGroupPrefix"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("PixelShiftGroupID"),
            JAVA_BYTE.withName("nShotsInPixelShiftGroup"),
            JAVA_BYTE.withName("numInPixelShiftGroup"),
            JAVA_SHORT.withName("prd_ImageHeight"),
            JAVA_SHORT.withName("prd_ImageWidth"),
            JAVA_SHORT.withName("prd_Total_bps"),
            JAVA_SHORT.withName("prd_Active_bps"),
            JAVA_SHORT.withName("prd_StorageMethod"),
            JAVA_SHORT.withName("prd_BayerPattern"),
            JAVA_SHORT.withName("SonyRawFileType"),
            JAVA_SHORT.withName("RAWFileType"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("Quality"),
            JAVA_SHORT.withName("FileFormat"),
            MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("MetaVersion"),
            MemoryLayout.paddingLayout(2)
        ).withName("sony"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("BlackLevelTop"),
            JAVA_SHORT.withName("BlackLevelBottom"),
            JAVA_SHORT.withName("offset_left"),
            JAVA_SHORT.withName("offset_top"),
            JAVA_SHORT.withName("clipBlack"),
            JAVA_SHORT.withName("clipWhite"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camDaylight"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camTungsten"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camFluorescent"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camFlash"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camCustom"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, JAVA_FLOAT)).withName("romm_camAuto"),
            JAVA_SHORT.withName("val018percent"),
            JAVA_SHORT.withName("val100percent"),
            JAVA_SHORT.withName("val170percent"),
            JAVA_SHORT.withName("MakerNoteKodak8a"),
            JAVA_FLOAT.withName("ISOCalibrationGain"),
            JAVA_FLOAT.withName("AnalogISO")
        ).withName("kodak"),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("Compression"),
            JAVA_SHORT.withName("BlackLevelDim"),
            MemoryLayout.sequenceLayout(8, JAVA_FLOAT).withName("BlackLevel"),
            JAVA_INT.withName("Multishot"),
            JAVA_FLOAT.withName("gamma"),
            MemoryLayout.sequenceLayout(3, JAVA_INT).withName("HighISOMultiplier"),
            JAVA_SHORT.withName("FocusStepNear"),
            JAVA_SHORT.withName("FocusStepCount"),
            JAVA_INT.withName("ZoomPosition"),
            JAVA_INT.withName("LensManufacturer")
        ).withName("panasonic"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, JAVA_BYTE).withName("DriveMode"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("FocusMode"),
            MemoryLayout.sequenceLayout(2, JAVA_SHORT).withName("AFPointSelected"),
            JAVA_SHORT.withName("AFPointSelected_Area"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("AFPointsInFocus_version"),
            JAVA_INT.withName("AFPointsInFocus"),
            JAVA_SHORT.withName("FocusPosition"),
            JAVA_SHORT.withName("AFAdjustment"),
            JAVA_BYTE.withName("AFPointMode"),
            JAVA_BYTE.withName("MultiExposure"),
            JAVA_SHORT.withName("Quality")
        ).withName("pentax"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("Software"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemType"),
            MemoryLayout.sequenceLayout(256, JAVA_BYTE).withName("FirmwareString"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("SystemModel")
        ).withName("phaseone"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            JAVA_SHORT.withName("AFStatus"),
            MemoryLayout.paddingLayout(2),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("AFAreaXPosition"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("AFAreaYPosition"),
            JAVA_SHORT.withName("AFAreaMode"),
            MemoryLayout.paddingLayout(2),
            JAVA_INT.withName("SensorWidth"),
            JAVA_INT.withName("SensorHeight"),
            JAVA_INT.withName("CroppedImageWidth"),
            JAVA_INT.withName("CroppedImageHeight"),
            JAVA_SHORT.withName("WideAdapter"),
            JAVA_SHORT.withName("CropMode"),
            JAVA_SHORT.withName("NDFilter"),
            JAVA_SHORT.withName("AutoBracketing"),
            JAVA_SHORT.withName("MacroMode"),
            JAVA_SHORT.withName("FlashMode"),
            MemoryLayout.paddingLayout(4),
            JAVA_DOUBLE.withName("FlashExposureComp"),
            JAVA_DOUBLE.withName("ManualFlashOutput")
        ).withName("ricoh"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ImageSizeFull"),
            MemoryLayout.sequenceLayout(4, JAVA_INT).withName("ImageSizeCrop"),
            MemoryLayout.sequenceLayout(2, JAVA_INT).withName("ColorSpace"),
            MemoryLayout.sequenceLayout(11, JAVA_INT).withName("key"),
            MemoryLayout.paddingLayout(4),
            JAVA_DOUBLE.withName("DigitalGain"),
            JAVA_INT.withName("DeviceType"),
            MemoryLayout.sequenceLayout(32, JAVA_BYTE).withName("LensFirmware"),
            MemoryLayout.paddingLayout(4)
        ).withName("samsung"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("FlashEC"),
            JAVA_FLOAT.withName("FlashGN"),
            JAVA_FLOAT.withName("CameraTemperature"),
            JAVA_FLOAT.withName("SensorTemperature"),
            JAVA_FLOAT.withName("SensorTemperature2"),
            JAVA_FLOAT.withName("LensTemperature"),
            JAVA_FLOAT.withName("AmbientTemperature"),
            JAVA_FLOAT.withName("BatteryTemperature"),
            JAVA_FLOAT.withName("exifAmbientTemperature"),
            JAVA_FLOAT.withName("exifHumidity"),
            JAVA_FLOAT.withName("exifPressure"),
            JAVA_FLOAT.withName("exifWaterDepth"),
            JAVA_FLOAT.withName("exifAcceleration"),
            JAVA_FLOAT.withName("exifCameraElevationAngle"),
            JAVA_FLOAT.withName("real_ISO"),
            JAVA_FLOAT.withName("exifExposureIndex"),
            JAVA_SHORT.withName("ColorSpace"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("firmware"),
            MemoryLayout.paddingLayout(2),
            JAVA_FLOAT.withName("ExposureCalibrationShift"),
            MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
                JAVA_INT.withName("AFInfoData_tag"),
                JAVA_SHORT.withName("AFInfoData_order"),
                MemoryLayout.paddingLayout(2),
                JAVA_INT.withName("AFInfoData_version"),
                JAVA_INT.withName("AFInfoData_length"),
                RuntimeHelper.POINTER.withName("AFInfoData")
            ).withName("libraw_afinfo_item_t")).withName("afdata"),
            JAVA_INT.withName("afcount"),
            MemoryLayout.paddingLayout(4)
        ).withName("common")
    ).withName("libraw_makernotes_t");
}


