// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$84 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$84() {}
    static final VarHandle const$0 = constants$83.const$5.varHandle(MemoryLayout.PathElement.groupElement("MinFocal"));
    static final VarHandle const$1 = constants$83.const$5.varHandle(MemoryLayout.PathElement.groupElement("MaxFocal"));
    static final VarHandle const$2 = constants$83.const$5.varHandle(MemoryLayout.PathElement.groupElement("MaxAp4MinFocal"));
    static final VarHandle const$3 = constants$83.const$5.varHandle(MemoryLayout.PathElement.groupElement("MaxAp4MaxFocal"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_FLOAT.withName("MinFocal"),
        JAVA_FLOAT.withName("MaxFocal"),
        JAVA_FLOAT.withName("MaxAp4MinFocal"),
        JAVA_FLOAT.withName("MaxAp4MaxFocal"),
        JAVA_FLOAT.withName("EXIF_MaxAp"),
        MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("LensMake"),
        MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Lens"),
        MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("LensSerial"),
        MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("InternalLensSerial"),
        JAVA_SHORT.withName("FocalLengthIn35mmFormat"),
        MemoryLayout.paddingLayout(2),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("EffectiveMaxAp"),
            JAVA_BYTE.withName("LensIDNumber"),
            JAVA_BYTE.withName("LensFStops"),
            JAVA_BYTE.withName("MCUVersion"),
            JAVA_BYTE.withName("LensType")
        ).withName("nikon"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("MinFocal"),
            JAVA_FLOAT.withName("MaxFocal"),
            JAVA_FLOAT.withName("MaxAp4MinFocal"),
            JAVA_FLOAT.withName("MaxAp4MaxFocal")
        ).withName("dng"),
        MemoryLayout.structLayout(
            JAVA_LONG.withName("LensID"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Lens"),
            JAVA_SHORT.withName("LensFormat"),
            JAVA_SHORT.withName("LensMount"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("CamID"),
            JAVA_SHORT.withName("CameraFormat"),
            JAVA_SHORT.withName("CameraMount"),
            MemoryLayout.sequenceLayout(64, JAVA_BYTE).withName("body"),
            JAVA_SHORT.withName("FocalType"),
            MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("LensFeatures_pre"),
            MemoryLayout.sequenceLayout(16, JAVA_BYTE).withName("LensFeatures_suf"),
            MemoryLayout.paddingLayout(2),
            JAVA_FLOAT.withName("MinFocal"),
            JAVA_FLOAT.withName("MaxFocal"),
            JAVA_FLOAT.withName("MaxAp4MinFocal"),
            JAVA_FLOAT.withName("MaxAp4MaxFocal"),
            JAVA_FLOAT.withName("MinAp4MinFocal"),
            JAVA_FLOAT.withName("MinAp4MaxFocal"),
            JAVA_FLOAT.withName("MaxAp"),
            JAVA_FLOAT.withName("MinAp"),
            JAVA_FLOAT.withName("CurFocal"),
            JAVA_FLOAT.withName("CurAp"),
            JAVA_FLOAT.withName("MaxAp4CurFocal"),
            JAVA_FLOAT.withName("MinAp4CurFocal"),
            JAVA_FLOAT.withName("MinFocusDistance"),
            JAVA_FLOAT.withName("FocusRangeIndex"),
            JAVA_FLOAT.withName("LensFStops"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("TeleconverterID"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Teleconverter"),
            JAVA_LONG.withName("AdapterID"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Adapter"),
            JAVA_LONG.withName("AttachmentID"),
            MemoryLayout.sequenceLayout(128, JAVA_BYTE).withName("Attachment"),
            JAVA_SHORT.withName("FocalUnits"),
            MemoryLayout.paddingLayout(2),
            JAVA_FLOAT.withName("FocalLengthIn35mmFormat")
        ).withName("makernotes")
    ).withName("libraw_lensinfo_t");
    static final VarHandle const$5 = constants$84.const$4.varHandle(MemoryLayout.PathElement.groupElement("MinFocal"));
}


