// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct libraw_makernotes_t {
 *     struct libraw_canon_makernotes_t canon;
 *     struct libraw_nikon_makernotes_t nikon;
 *     struct libraw_hasselblad_makernotes_t hasselblad;
 *     struct libraw_fuji_info_t fuji;
 *     struct libraw_olympus_makernotes_t olympus;
 *     struct libraw_sony_info_t sony;
 *     struct libraw_kodak_makernotes_t kodak;
 *     struct libraw_panasonic_makernotes_t panasonic;
 *     struct libraw_pentax_makernotes_t pentax;
 *     struct libraw_p1_makernotes_t phaseone;
 *     struct libraw_ricoh_makernotes_t ricoh;
 *     struct libraw_samsung_makernotes_t samsung;
 *     struct libraw_metadata_common_t common;
 * };
 * }
 */
public class libraw_makernotes_t {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("ColorDataVer"),
            Constants$root.C_LONG$LAYOUT.withName("ColorDataSubVer"),
            Constants$root.C_LONG$LAYOUT.withName("SpecularWhiteLevel"),
            Constants$root.C_LONG$LAYOUT.withName("NormalWhiteLevel"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_LONG$LAYOUT).withName("ChannelBlackLevel"),
            Constants$root.C_LONG$LAYOUT.withName("AverageBlackLevel"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_LONG$LAYOUT).withName("multishot"),
            Constants$root.C_SHORT$LAYOUT.withName("MeteringMode"),
            Constants$root.C_SHORT$LAYOUT.withName("SpotMeteringMode"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashMeteringMode"),
            MemoryLayout.paddingLayout(8),
            Constants$root.C_SHORT$LAYOUT.withName("FlashExposureLock"),
            Constants$root.C_SHORT$LAYOUT.withName("ExposureMode"),
            Constants$root.C_SHORT$LAYOUT.withName("AESetting"),
            Constants$root.C_SHORT$LAYOUT.withName("ImageStabilization"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashMode"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashActivity"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashBits"),
            Constants$root.C_SHORT$LAYOUT.withName("ManualFlashOutput"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashOutput"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashGuideNumber"),
            Constants$root.C_SHORT$LAYOUT.withName("ContinuousDrive"),
            Constants$root.C_SHORT$LAYOUT.withName("SensorWidth"),
            Constants$root.C_SHORT$LAYOUT.withName("SensorHeight"),
            Constants$root.C_LONG$LAYOUT.withName("AFMicroAdjMode"),
            Constants$root.C_FLOAT$LAYOUT.withName("AFMicroAdjValue"),
            Constants$root.C_SHORT$LAYOUT.withName("MakernotesFlip"),
            Constants$root.C_SHORT$LAYOUT.withName("RecordMode"),
            Constants$root.C_SHORT$LAYOUT.withName("SRAWQuality"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("wbi"),
            Constants$root.C_SHORT$LAYOUT.withName("RF_lensID"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("AutoLightingOptimizer"),
            Constants$root.C_LONG$LAYOUT.withName("HighlightTonePriority"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("t"),
                Constants$root.C_SHORT$LAYOUT.withName("l"),
                Constants$root.C_SHORT$LAYOUT.withName("b"),
                Constants$root.C_SHORT$LAYOUT.withName("r")
            ).withName("DefaultCropAbsolute"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("t"),
                Constants$root.C_SHORT$LAYOUT.withName("l"),
                Constants$root.C_SHORT$LAYOUT.withName("b"),
                Constants$root.C_SHORT$LAYOUT.withName("r")
            ).withName("RecommendedImageArea"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("t"),
                Constants$root.C_SHORT$LAYOUT.withName("l"),
                Constants$root.C_SHORT$LAYOUT.withName("b"),
                Constants$root.C_SHORT$LAYOUT.withName("r")
            ).withName("LeftOpticalBlack"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("t"),
                Constants$root.C_SHORT$LAYOUT.withName("l"),
                Constants$root.C_SHORT$LAYOUT.withName("b"),
                Constants$root.C_SHORT$LAYOUT.withName("r")
            ).withName("UpperOpticalBlack"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("t"),
                Constants$root.C_SHORT$LAYOUT.withName("l"),
                Constants$root.C_SHORT$LAYOUT.withName("b"),
                Constants$root.C_SHORT$LAYOUT.withName("r")
            ).withName("ActiveArea"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("ISOgain")
        ).withName("canon"),
        MemoryLayout.structLayout(
            Constants$root.C_DOUBLE$LAYOUT.withName("ExposureBracketValue"),
            Constants$root.C_SHORT$LAYOUT.withName("ActiveDLighting"),
            Constants$root.C_SHORT$LAYOUT.withName("ShootingMode"),
            MemoryLayout.sequenceLayout(7, Constants$root.C_CHAR$LAYOUT).withName("ImageStabilization"),
            Constants$root.C_CHAR$LAYOUT.withName("VibrationReduction"),
            Constants$root.C_CHAR$LAYOUT.withName("VRMode"),
            MemoryLayout.sequenceLayout(13, Constants$root.C_CHAR$LAYOUT).withName("FlashSetting"),
            MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("FlashType"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureCompensation"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("ExternalFlashExposureComp"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureBracketValue"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashMode"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation2"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation3"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation4"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashSource"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_CHAR$LAYOUT).withName("FlashFirmware"),
            Constants$root.C_CHAR$LAYOUT.withName("ExternalFlashFlags"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashControlCommanderMode"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashOutputAndCompensation"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashFocalLength"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashGNDistance"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupControlMode"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupOutputAndCompensation"),
            Constants$root.C_CHAR$LAYOUT.withName("FlashColorFilter"),
            MemoryLayout.paddingLayout(8),
            Constants$root.C_SHORT$LAYOUT.withName("NEFCompression"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("ExposureMode"),
            Constants$root.C_LONG$LAYOUT.withName("ExposureProgram"),
            Constants$root.C_LONG$LAYOUT.withName("nMEshots"),
            Constants$root.C_LONG$LAYOUT.withName("MEgainOn"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.sequenceLayout(4, Constants$root.C_DOUBLE$LAYOUT).withName("ME_WB"),
            Constants$root.C_CHAR$LAYOUT.withName("AFFineTune"),
            Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneIndex"),
            Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneAdj"),
            MemoryLayout.paddingLayout(8),
            Constants$root.C_LONG$LAYOUT.withName("LensDataVersion"),
            Constants$root.C_LONG$LAYOUT.withName("FlashInfoVersion"),
            Constants$root.C_LONG$LAYOUT.withName("ColorBalanceVersion"),
            Constants$root.C_CHAR$LAYOUT.withName("key"),
            MemoryLayout.paddingLayout(8),
            MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("NEFBitDepth"),
            Constants$root.C_SHORT$LAYOUT.withName("HighSpeedCropFormat"),
            MemoryLayout.structLayout(
                Constants$root.C_SHORT$LAYOUT.withName("cleft"),
                Constants$root.C_SHORT$LAYOUT.withName("ctop"),
                Constants$root.C_SHORT$LAYOUT.withName("cwidth"),
                Constants$root.C_SHORT$LAYOUT.withName("cheight")
            ).withName("SensorHighSpeedCrop"),
            Constants$root.C_SHORT$LAYOUT.withName("SensorWidth"),
            Constants$root.C_SHORT$LAYOUT.withName("SensorHeight"),
            Constants$root.C_SHORT$LAYOUT.withName("Active_D_Lighting"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("ShotInfoVersion"),
            Constants$root.C_SHORT$LAYOUT.withName("MakernotesFlip"),
            MemoryLayout.paddingLayout(48),
            Constants$root.C_DOUBLE$LAYOUT.withName("RollAngle"),
            Constants$root.C_DOUBLE$LAYOUT.withName("PitchAngle"),
            Constants$root.C_DOUBLE$LAYOUT.withName("YawAngle")
        ).withName("nikon"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("BaseISO"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_DOUBLE$LAYOUT.withName("Gain"),
            MemoryLayout.sequenceLayout(8, Constants$root.C_CHAR$LAYOUT).withName("Sensor"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("SensorUnit"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("HostBody"),
            Constants$root.C_LONG$LAYOUT.withName("SensorCode"),
            Constants$root.C_LONG$LAYOUT.withName("SensorSubCode"),
            Constants$root.C_LONG$LAYOUT.withName("CoatingCode"),
            Constants$root.C_LONG$LAYOUT.withName("uncropped"),
            MemoryLayout.sequenceLayout(32, Constants$root.C_CHAR$LAYOUT).withName("CaptureSequenceInitiator"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("SensorUnitConnector"),
            Constants$root.C_LONG$LAYOUT.withName("format"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("nIFD_CM"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("RecommendedCrop"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.sequenceLayout(4, MemoryLayout.sequenceLayout(3, Constants$root.C_DOUBLE$LAYOUT)).withName("mnColorMatrix")
        ).withName("hasselblad"),
        MemoryLayout.structLayout(
            Constants$root.C_FLOAT$LAYOUT.withName("ExpoMidPointShift"),
            Constants$root.C_SHORT$LAYOUT.withName("DynamicRange"),
            Constants$root.C_SHORT$LAYOUT.withName("FilmMode"),
            Constants$root.C_SHORT$LAYOUT.withName("DynamicRangeSetting"),
            Constants$root.C_SHORT$LAYOUT.withName("DevelopmentDynamicRange"),
            Constants$root.C_SHORT$LAYOUT.withName("AutoDynamicRange"),
            Constants$root.C_SHORT$LAYOUT.withName("DRangePriority"),
            Constants$root.C_SHORT$LAYOUT.withName("DRangePriorityAuto"),
            Constants$root.C_SHORT$LAYOUT.withName("DRangePriorityFixed"),
            Constants$root.C_FLOAT$LAYOUT.withName("BrightnessCompensation"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusMode"),
            Constants$root.C_SHORT$LAYOUT.withName("AFMode"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("FocusPixel"),
            Constants$root.C_SHORT$LAYOUT.withName("PrioritySettings"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("FocusSettings"),
            Constants$root.C_LONG$LAYOUT.withName("AF_C_Settings"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusWarning"),
            MemoryLayout.sequenceLayout(3, Constants$root.C_SHORT$LAYOUT).withName("ImageStabilization"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashMode"),
            Constants$root.C_SHORT$LAYOUT.withName("WB_Preset"),
            Constants$root.C_SHORT$LAYOUT.withName("ShutterType"),
            Constants$root.C_SHORT$LAYOUT.withName("ExrMode"),
            Constants$root.C_SHORT$LAYOUT.withName("Macro"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("Rating"),
            Constants$root.C_SHORT$LAYOUT.withName("CropMode"),
            MemoryLayout.sequenceLayout(13, Constants$root.C_CHAR$LAYOUT).withName("SerialSignature"),
            MemoryLayout.sequenceLayout(5, Constants$root.C_CHAR$LAYOUT).withName("SensorID"),
            MemoryLayout.sequenceLayout(5, Constants$root.C_CHAR$LAYOUT).withName("RAFVersion"),
            MemoryLayout.paddingLayout(24),
            Constants$root.C_LONG$LAYOUT.withName("RAFDataGeneration"),
            Constants$root.C_SHORT$LAYOUT.withName("RAFDataVersion"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("isTSNERDTS"),
            Constants$root.C_SHORT$LAYOUT.withName("DriveMode"),
            MemoryLayout.sequenceLayout(9, Constants$root.C_SHORT$LAYOUT).withName("BlackLevel"),
            MemoryLayout.sequenceLayout(32, Constants$root.C_LONG$LAYOUT).withName("RAFData_ImageSizeTable"),
            Constants$root.C_LONG$LAYOUT.withName("AutoBracketing"),
            Constants$root.C_LONG$LAYOUT.withName("SequenceNumber"),
            Constants$root.C_LONG$LAYOUT.withName("SeriesLength"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_FLOAT$LAYOUT).withName("PixelShiftOffset"),
            Constants$root.C_LONG$LAYOUT.withName("ImageCount")
        ).withName("fuji"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(6, Constants$root.C_CHAR$LAYOUT).withName("CameraType2"),
            Constants$root.C_SHORT$LAYOUT.withName("ValidBits"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("SensorCalibration"),
            MemoryLayout.sequenceLayout(5, Constants$root.C_SHORT$LAYOUT).withName("DriveMode"),
            Constants$root.C_SHORT$LAYOUT.withName("ColorSpace"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("FocusMode"),
            Constants$root.C_SHORT$LAYOUT.withName("AutoFocus"),
            Constants$root.C_SHORT$LAYOUT.withName("AFPoint"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_LONG$LAYOUT).withName("AFAreas"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.sequenceLayout(5, Constants$root.C_DOUBLE$LAYOUT).withName("AFPointSelected"),
            Constants$root.C_SHORT$LAYOUT.withName("AFResult"),
            Constants$root.C_CHAR$LAYOUT.withName("AFFineTune"),
            MemoryLayout.paddingLayout(8),
            MemoryLayout.sequenceLayout(3, Constants$root.C_SHORT$LAYOUT).withName("AFFineTuneAdj"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.sequenceLayout(3, Constants$root.C_LONG$LAYOUT).withName("SpecialMode"),
            Constants$root.C_SHORT$LAYOUT.withName("ZoomStepCount"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusStepCount"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusStepInfinity"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusStepNear"),
            Constants$root.C_DOUBLE$LAYOUT.withName("FocusDistance"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("AspectFrame"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("StackedImage"),
            Constants$root.C_CHAR$LAYOUT.withName("isLiveND"),
            MemoryLayout.paddingLayout(24),
            Constants$root.C_LONG$LAYOUT.withName("LiveNDfactor"),
            Constants$root.C_SHORT$LAYOUT.withName("Panorama_mode"),
            Constants$root.C_SHORT$LAYOUT.withName("Panorama_frameNum"),
            MemoryLayout.paddingLayout(32)
        ).withName("olympus"),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("CameraType"),
            Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_version"),
            Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_ReleaseMode2"),
            Constants$root.C_LONG$LAYOUT.withName("Sony0x9400_SequenceImageNumber"),
            Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_SequenceLength1"),
            MemoryLayout.paddingLayout(24),
            Constants$root.C_LONG$LAYOUT.withName("Sony0x9400_SequenceFileNumber"),
            Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_SequenceLength2"),
            Constants$root.C_CHAR$LAYOUT.withName("AFAreaModeSetting"),
            Constants$root.C_SHORT$LAYOUT.withName("AFAreaMode"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("FlexibleSpotPosition"),
            Constants$root.C_CHAR$LAYOUT.withName("AFPointSelected"),
            Constants$root.C_CHAR$LAYOUT.withName("AFPointSelected_0x201e"),
            Constants$root.C_SHORT$LAYOUT.withName("nAFPointsUsed"),
            MemoryLayout.sequenceLayout(10, Constants$root.C_CHAR$LAYOUT).withName("AFPointsUsed"),
            Constants$root.C_CHAR$LAYOUT.withName("AFTracking"),
            Constants$root.C_CHAR$LAYOUT.withName("AFType"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("FocusLocation"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusPosition"),
            Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjValue"),
            Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjOn"),
            Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjRegisteredLenses"),
            MemoryLayout.paddingLayout(8),
            Constants$root.C_SHORT$LAYOUT.withName("VariableLowPassFilter"),
            Constants$root.C_LONG$LAYOUT.withName("LongExposureNoiseReduction"),
            Constants$root.C_SHORT$LAYOUT.withName("HighISONoiseReduction"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("HDR"),
            Constants$root.C_SHORT$LAYOUT.withName("group2010"),
            Constants$root.C_SHORT$LAYOUT.withName("group9050"),
            Constants$root.C_SHORT$LAYOUT.withName("real_iso_offset"),
            Constants$root.C_SHORT$LAYOUT.withName("MeteringMode_offset"),
            Constants$root.C_SHORT$LAYOUT.withName("ExposureProgram_offset"),
            Constants$root.C_SHORT$LAYOUT.withName("ReleaseMode2_offset"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("MinoltaCamID"),
            Constants$root.C_FLOAT$LAYOUT.withName("firmware"),
            Constants$root.C_SHORT$LAYOUT.withName("ImageCount3_offset"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("ImageCount3"),
            Constants$root.C_LONG$LAYOUT.withName("ElectronicFrontCurtainShutter"),
            Constants$root.C_SHORT$LAYOUT.withName("MeteringMode2"),
            MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("SonyDateTime"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("ShotNumberSincePowerUp"),
            Constants$root.C_SHORT$LAYOUT.withName("PixelShiftGroupPrefix"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("PixelShiftGroupID"),
            Constants$root.C_CHAR$LAYOUT.withName("nShotsInPixelShiftGroup"),
            Constants$root.C_CHAR$LAYOUT.withName("numInPixelShiftGroup"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_ImageHeight"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_ImageWidth"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_Total_bps"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_Active_bps"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_StorageMethod"),
            Constants$root.C_SHORT$LAYOUT.withName("prd_BayerPattern"),
            Constants$root.C_SHORT$LAYOUT.withName("SonyRawFileType"),
            Constants$root.C_SHORT$LAYOUT.withName("RAWFileType"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("Quality"),
            Constants$root.C_SHORT$LAYOUT.withName("FileFormat"),
            MemoryLayout.sequenceLayout(16, Constants$root.C_CHAR$LAYOUT).withName("MetaVersion"),
            MemoryLayout.paddingLayout(16)
        ).withName("sony"),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("BlackLevelTop"),
            Constants$root.C_SHORT$LAYOUT.withName("BlackLevelBottom"),
            Constants$root.C_SHORT$LAYOUT.withName("offset_left"),
            Constants$root.C_SHORT$LAYOUT.withName("offset_top"),
            Constants$root.C_SHORT$LAYOUT.withName("clipBlack"),
            Constants$root.C_SHORT$LAYOUT.withName("clipWhite"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camDaylight"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camTungsten"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camFluorescent"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camFlash"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camCustom"),
            MemoryLayout.sequenceLayout(3, MemoryLayout.sequenceLayout(3, Constants$root.C_FLOAT$LAYOUT)).withName("romm_camAuto"),
            Constants$root.C_SHORT$LAYOUT.withName("val018percent"),
            Constants$root.C_SHORT$LAYOUT.withName("val100percent"),
            Constants$root.C_SHORT$LAYOUT.withName("val170percent"),
            Constants$root.C_SHORT$LAYOUT.withName("MakerNoteKodak8a"),
            Constants$root.C_FLOAT$LAYOUT.withName("ISOCalibrationGain"),
            Constants$root.C_FLOAT$LAYOUT.withName("AnalogISO")
        ).withName("kodak"),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("Compression"),
            Constants$root.C_SHORT$LAYOUT.withName("BlackLevelDim"),
            MemoryLayout.sequenceLayout(8, Constants$root.C_FLOAT$LAYOUT).withName("BlackLevel"),
            Constants$root.C_LONG$LAYOUT.withName("Multishot"),
            Constants$root.C_FLOAT$LAYOUT.withName("gamma"),
            MemoryLayout.sequenceLayout(3, Constants$root.C_LONG$LAYOUT).withName("HighISOMultiplier"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusStepNear"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusStepCount"),
            Constants$root.C_LONG$LAYOUT.withName("ZoomPosition"),
            Constants$root.C_LONG$LAYOUT.withName("LensManufacturer")
        ).withName("panasonic"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("DriveMode"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("FocusMode"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("AFPointSelected"),
            Constants$root.C_SHORT$LAYOUT.withName("AFPointSelected_Area"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("AFPointsInFocus_version"),
            Constants$root.C_LONG$LAYOUT.withName("AFPointsInFocus"),
            Constants$root.C_SHORT$LAYOUT.withName("FocusPosition"),
            Constants$root.C_SHORT$LAYOUT.withName("AFAdjustment"),
            Constants$root.C_CHAR$LAYOUT.withName("AFPointMode"),
            Constants$root.C_CHAR$LAYOUT.withName("MultiExposure"),
            Constants$root.C_SHORT$LAYOUT.withName("Quality")
        ).withName("pentax"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("Software"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("SystemType"),
            MemoryLayout.sequenceLayout(256, Constants$root.C_CHAR$LAYOUT).withName("FirmwareString"),
            MemoryLayout.sequenceLayout(64, Constants$root.C_CHAR$LAYOUT).withName("SystemModel")
        ).withName("phaseone"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("AFStatus"),
            MemoryLayout.paddingLayout(16),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("AFAreaXPosition"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("AFAreaYPosition"),
            Constants$root.C_SHORT$LAYOUT.withName("AFAreaMode"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_LONG$LAYOUT.withName("SensorWidth"),
            Constants$root.C_LONG$LAYOUT.withName("SensorHeight"),
            Constants$root.C_LONG$LAYOUT.withName("CroppedImageWidth"),
            Constants$root.C_LONG$LAYOUT.withName("CroppedImageHeight"),
            Constants$root.C_SHORT$LAYOUT.withName("WideAdapter"),
            Constants$root.C_SHORT$LAYOUT.withName("CropMode"),
            Constants$root.C_SHORT$LAYOUT.withName("NDFilter"),
            Constants$root.C_SHORT$LAYOUT.withName("AutoBracketing"),
            Constants$root.C_SHORT$LAYOUT.withName("MacroMode"),
            Constants$root.C_SHORT$LAYOUT.withName("FlashMode"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_DOUBLE$LAYOUT.withName("FlashExposureComp"),
            Constants$root.C_DOUBLE$LAYOUT.withName("ManualFlashOutput")
        ).withName("ricoh"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(4, Constants$root.C_LONG$LAYOUT).withName("ImageSizeFull"),
            MemoryLayout.sequenceLayout(4, Constants$root.C_LONG$LAYOUT).withName("ImageSizeCrop"),
            MemoryLayout.sequenceLayout(2, Constants$root.C_LONG$LAYOUT).withName("ColorSpace"),
            MemoryLayout.sequenceLayout(11, Constants$root.C_LONG$LAYOUT).withName("key"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_DOUBLE$LAYOUT.withName("DigitalGain"),
            Constants$root.C_LONG$LAYOUT.withName("DeviceType"),
            MemoryLayout.sequenceLayout(32, Constants$root.C_CHAR$LAYOUT).withName("LensFirmware"),
            MemoryLayout.paddingLayout(32)
        ).withName("samsung"),
        MemoryLayout.structLayout(
            Constants$root.C_FLOAT$LAYOUT.withName("FlashEC"),
            Constants$root.C_FLOAT$LAYOUT.withName("FlashGN"),
            Constants$root.C_FLOAT$LAYOUT.withName("CameraTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("SensorTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("SensorTemperature2"),
            Constants$root.C_FLOAT$LAYOUT.withName("LensTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("AmbientTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("BatteryTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifAmbientTemperature"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifHumidity"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifPressure"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifWaterDepth"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifAcceleration"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifCameraElevationAngle"),
            Constants$root.C_FLOAT$LAYOUT.withName("real_ISO"),
            Constants$root.C_FLOAT$LAYOUT.withName("exifExposureIndex"),
            Constants$root.C_SHORT$LAYOUT.withName("ColorSpace"),
            MemoryLayout.sequenceLayout(128, Constants$root.C_CHAR$LAYOUT).withName("firmware"),
            MemoryLayout.paddingLayout(16),
            Constants$root.C_FLOAT$LAYOUT.withName("ExposureCalibrationShift"),
            MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("AFInfoData_tag"),
                Constants$root.C_SHORT$LAYOUT.withName("AFInfoData_order"),
                MemoryLayout.paddingLayout(16),
                Constants$root.C_LONG$LAYOUT.withName("AFInfoData_version"),
                Constants$root.C_LONG$LAYOUT.withName("AFInfoData_length"),
                Constants$root.C_POINTER$LAYOUT.withName("AFInfoData")
            ).withName("libraw_afinfo_item_t")).withName("afdata"),
            Constants$root.C_LONG$LAYOUT.withName("afcount"),
            MemoryLayout.paddingLayout(32)
        ).withName("common")
    ).withName("libraw_makernotes_t");
    public static MemoryLayout $LAYOUT() {
        return libraw_makernotes_t.$struct$LAYOUT;
    }
    public static MemorySegment canon$slice(MemorySegment seg) {
        return seg.asSlice(0, 160);
    }
    public static MemorySegment nikon$slice(MemorySegment seg) {
        return seg.asSlice(160, 224);
    }
    public static MemorySegment hasselblad$slice(MemorySegment seg) {
        return seg.asSlice(384, 384);
    }
    public static MemorySegment fuji$slice(MemorySegment seg) {
        return seg.asSlice(768, 280);
    }
    public static MemorySegment olympus$slice(MemorySegment seg) {
        return seg.asSlice(1048, 408);
    }
    public static MemorySegment sony$slice(MemorySegment seg) {
        return seg.asSlice(1456, 180);
    }
    public static MemorySegment kodak$slice(MemorySegment seg) {
        return seg.asSlice(1636, 244);
    }
