// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.ValueLayout.*;
public class libraw_nikon_makernotes_t {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_DOUBLE$LAYOUT.withName("ExposureBracketValue"),
        Constants$root.C_SHORT$LAYOUT.withName("ActiveDLighting"),
        Constants$root.C_SHORT$LAYOUT.withName("ShootingMode"),
        MemoryLayout.sequenceLayout(7, Constants$root.C_CHAR$LAYOUT).withName("ImageStabilization"),
        Constants$root.C_CHAR$LAYOUT.withName("VibrationReduction"),
        Constants$root.C_CHAR$LAYOUT.withName("VRMode"),
        MemoryLayout.sequenceLayout(13, Constants$root.C_CHAR$LAYOUT).withName("FlashSetting"),
        MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("FlashType"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureCompensation"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("ExternalFlashExposureComp"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureBracketValue"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashMode"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation2"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation3"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation4"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashSource"),
        MemoryLayout.sequenceLayout(2, Constants$root.C_CHAR$LAYOUT).withName("FlashFirmware"),
        Constants$root.C_CHAR$LAYOUT.withName("ExternalFlashFlags"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashControlCommanderMode"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashOutputAndCompensation"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashFocalLength"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashGNDistance"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupControlMode"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupOutputAndCompensation"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashColorFilter"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_SHORT$LAYOUT.withName("NEFCompression"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("ExposureMode"),
        Constants$root.C_LONG$LAYOUT.withName("ExposureProgram"),
        Constants$root.C_LONG$LAYOUT.withName("nMEshots"),
        Constants$root.C_LONG$LAYOUT.withName("MEgainOn"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.sequenceLayout(4, Constants$root.C_DOUBLE$LAYOUT).withName("ME_WB"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTune"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneIndex"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneAdj"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_LONG$LAYOUT.withName("LensDataVersion"),
        Constants$root.C_LONG$LAYOUT.withName("FlashInfoVersion"),
        Constants$root.C_LONG$LAYOUT.withName("ColorBalanceVersion"),
        Constants$root.C_CHAR$LAYOUT.withName("key"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("NEFBitDepth"),
        Constants$root.C_SHORT$LAYOUT.withName("HighSpeedCropFormat"),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("cleft"),
            Constants$root.C_SHORT$LAYOUT.withName("ctop"),
            Constants$root.C_SHORT$LAYOUT.withName("cwidth"),
            Constants$root.C_SHORT$LAYOUT.withName("cheight")
        ).withName("SensorHighSpeedCrop"),
        Constants$root.C_SHORT$LAYOUT.withName("SensorWidth"),
        Constants$root.C_SHORT$LAYOUT.withName("SensorHeight"),
        Constants$root.C_SHORT$LAYOUT.withName("Active_D_Lighting"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("ShotInfoVersion"),
        Constants$root.C_SHORT$LAYOUT.withName("MakernotesFlip"),
        MemoryLayout.paddingLayout(48),
        Constants$root.C_DOUBLE$LAYOUT.withName("RollAngle"),
        Constants$root.C_DOUBLE$LAYOUT.withName("PitchAngle"),
        Constants$root.C_DOUBLE$LAYOUT.withName("YawAngle")
    );
    public static MemoryLayout $LAYOUT() {
        return libraw_nikon_makernotes_t.$struct$LAYOUT;
    }
    static final VarHandle ExposureBracketValue$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ExposureBracketValue"));
    public static VarHandle ExposureBracketValue$VH() {
        return libraw_nikon_makernotes_t.ExposureBracketValue$VH;
    }
    public static double ExposureBracketValue$get(MemorySegment seg) {
        return (double)libraw_nikon_makernotes_t.ExposureBracketValue$VH.get(seg);
    }
    public static void ExposureBracketValue$set( MemorySegment seg, double x) {
        libraw_nikon_makernotes_t.ExposureBracketValue$VH.set(seg, x);
    }
    public static double ExposureBracketValue$get(MemorySegment seg, long index) {
