// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class libraw_sony_info_t {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        C_SHORT.withName("CameraType"),
        C_CHAR.withName("Sony0x9400_version"),
        C_CHAR.withName("Sony0x9400_ReleaseMode2"),
        C_INT.withName("Sony0x9400_SequenceImageNumber"),
        C_CHAR.withName("Sony0x9400_SequenceLength1"),
        MemoryLayout.paddingLayout(24),
        C_INT.withName("Sony0x9400_SequenceFileNumber"),
        C_CHAR.withName("Sony0x9400_SequenceLength2"),
        C_CHAR.withName("AFAreaModeSetting"),
        MemoryLayout.sequenceLayout(2, C_SHORT).withName("FlexibleSpotPosition"),
        C_CHAR.withName("AFPointSelected"),
        MemoryLayout.sequenceLayout(10, C_CHAR).withName("AFPointsUsed"),
        C_CHAR.withName("AFTracking"),
        C_CHAR.withName("AFType"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.sequenceLayout(4, C_SHORT).withName("FocusLocation"),
        C_CHAR.withName("AFMicroAdjValue"),
        C_CHAR.withName("AFMicroAdjOn"),
        C_CHAR.withName("AFMicroAdjRegisteredLenses"),
        MemoryLayout.paddingLayout(8),
        C_SHORT.withName("VariableLowPassFilter"),
        MemoryLayout.paddingLayout(16),
        C_INT.withName("LongExposureNoiseReduction"),
        C_SHORT.withName("HighISONoiseReduction"),
        MemoryLayout.sequenceLayout(2, C_SHORT).withName("HDR"),
        C_SHORT.withName("group2010"),
        C_SHORT.withName("real_iso_offset"),
        C_SHORT.withName("MeteringMode_offset"),
        C_SHORT.withName("ExposureProgram_offset"),
        C_SHORT.withName("ReleaseMode2_offset"),
        C_INT.withName("MinoltaCamID"),
        C_FLOAT.withName("firmware"),
        C_SHORT.withName("ImageCount3_offset"),
        MemoryLayout.paddingLayout(16),
        C_INT.withName("ImageCount3"),
        C_INT.withName("ElectronicFrontCurtainShutter"),
        C_SHORT.withName("MeteringMode2"),
        MemoryLayout.sequenceLayout(20, C_CHAR).withName("SonyDateTime"),
        MemoryLayout.paddingLayout(16),
        C_INT.withName("ShotNumberSincePowerUp"),
        C_SHORT.withName("PixelShiftGroupPrefix"),
        MemoryLayout.paddingLayout(16),
        C_INT.withName("PixelShiftGroupID"),
        C_CHAR.withName("nShotsInPixelShiftGroup"),
        C_CHAR.withName("numInPixelShiftGroup"),
        C_SHORT.withName("prd_ImageHeight"),
        C_SHORT.withName("prd_ImageWidth"),
        C_SHORT.withName("prd_RawBitDepth"),
        C_SHORT.withName("prd_StorageMethod"),
        C_SHORT.withName("prd_BayerPattern"),
        C_SHORT.withName("SonyRawFileType"),
        C_SHORT.withName("RAWFileType"),
        C_INT.withName("Quality"),
        C_SHORT.withName("FileFormat"),
        MemoryLayout.paddingLayout(16)
    );
    public static MemoryLayout $LAYOUT() {
        return libraw_sony_info_t.$struct$LAYOUT;
    }
    static final VarHandle CameraType$VH = $struct$LAYOUT.varHandle(short.class, MemoryLayout.PathElement.groupElement("CameraType"));
    public static VarHandle CameraType$VH() {
        return libraw_sony_info_t.CameraType$VH;
    }
    public static short CameraType$get(MemorySegment seg) {
        return (short)libraw_sony_info_t.CameraType$VH.get(seg);
    }
    public static void CameraType$set( MemorySegment seg, short x) {
        libraw_sony_info_t.CameraType$VH.set(seg, x);
    }
    public static short CameraType$get(MemorySegment seg, long index) {
        return (short)libraw_sony_info_t.CameraType$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void CameraType$set(MemorySegment seg, long index, short x) {
        libraw_sony_info_t.CameraType$VH.set(seg.asSlice(index*sizeof()), x);
    }
