// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.ValueLayout.*;
public class libraw_nikon_makernotes_t {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_DOUBLE$LAYOUT.withName("ExposureBracketValue"),
        Constants$root.C_SHORT$LAYOUT.withName("ActiveDLighting"),
        Constants$root.C_SHORT$LAYOUT.withName("ShootingMode"),
        MemoryLayout.sequenceLayout(7, Constants$root.C_CHAR$LAYOUT).withName("ImageStabilization"),
        Constants$root.C_CHAR$LAYOUT.withName("VibrationReduction"),
        Constants$root.C_CHAR$LAYOUT.withName("VRMode"),
        MemoryLayout.sequenceLayout(7, Constants$root.C_CHAR$LAYOUT).withName("FocusMode"),
        Constants$root.C_CHAR$LAYOUT.withName("AFPoint"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_SHORT$LAYOUT.withName("AFPointsInFocus"),
        Constants$root.C_CHAR$LAYOUT.withName("ContrastDetectAF"),
        Constants$root.C_CHAR$LAYOUT.withName("AFAreaMode"),
        Constants$root.C_CHAR$LAYOUT.withName("PhaseDetectAF"),
        Constants$root.C_CHAR$LAYOUT.withName("PrimaryAFPoint"),
        MemoryLayout.sequenceLayout(29, Constants$root.C_CHAR$LAYOUT).withName("AFPointsUsed"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_SHORT$LAYOUT.withName("AFImageWidth"),
        Constants$root.C_SHORT$LAYOUT.withName("AFImageHeight"),
        Constants$root.C_SHORT$LAYOUT.withName("AFAreaXPposition"),
        Constants$root.C_SHORT$LAYOUT.withName("AFAreaYPosition"),
        Constants$root.C_SHORT$LAYOUT.withName("AFAreaWidth"),
        Constants$root.C_SHORT$LAYOUT.withName("AFAreaHeight"),
        Constants$root.C_CHAR$LAYOUT.withName("ContrastDetectAFInFocus"),
        MemoryLayout.sequenceLayout(13, Constants$root.C_CHAR$LAYOUT).withName("FlashSetting"),
        MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("FlashType"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureCompensation"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("ExternalFlashExposureComp"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashExposureBracketValue"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashMode"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation2"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation3"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashExposureCompensation4"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashSource"),
        MemoryLayout.sequenceLayout(2, Constants$root.C_CHAR$LAYOUT).withName("FlashFirmware"),
        Constants$root.C_CHAR$LAYOUT.withName("ExternalFlashFlags"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashControlCommanderMode"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashOutputAndCompensation"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashFocalLength"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashGNDistance"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupControlMode"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_CHAR$LAYOUT).withName("FlashGroupOutputAndCompensation"),
        Constants$root.C_CHAR$LAYOUT.withName("FlashColorFilter"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_SHORT$LAYOUT.withName("NEFCompression"),
        Constants$root.C_LONG$LAYOUT.withName("ExposureMode"),
        Constants$root.C_LONG$LAYOUT.withName("ExposureProgram"),
        Constants$root.C_LONG$LAYOUT.withName("nMEshots"),
        Constants$root.C_LONG$LAYOUT.withName("MEgainOn"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.sequenceLayout(4, Constants$root.C_DOUBLE$LAYOUT).withName("ME_WB"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTune"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneIndex"),
        Constants$root.C_CHAR$LAYOUT.withName("AFFineTuneAdj"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_LONG$LAYOUT.withName("LensDataVersion"),
        Constants$root.C_LONG$LAYOUT.withName("FlashInfoVersion"),
        Constants$root.C_LONG$LAYOUT.withName("ColorBalanceVersion"),
        Constants$root.C_CHAR$LAYOUT.withName("key"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("NEFBitDepth"),
        Constants$root.C_SHORT$LAYOUT.withName("HighSpeedCropFormat"),
        MemoryLayout.structLayout(
            Constants$root.C_SHORT$LAYOUT.withName("cleft"),
            Constants$root.C_SHORT$LAYOUT.withName("ctop"),
            Constants$root.C_SHORT$LAYOUT.withName("cwidth"),
            Constants$root.C_SHORT$LAYOUT.withName("cheight")
        ).withName("SensorHighSpeedCrop"),
        Constants$root.C_SHORT$LAYOUT.withName("SensorWidth"),
        Constants$root.C_SHORT$LAYOUT.withName("SensorHeight")
    );
    public static MemoryLayout $LAYOUT() {
        return libraw_nikon_makernotes_t.$struct$LAYOUT;
    }
    static final VarHandle ExposureBracketValue$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ExposureBracketValue"));
    public static VarHandle ExposureBracketValue$VH() {
