// Generated by jextract

package org.libraw.win;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.ValueLayout.*;
public class libraw_sony_info_t {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_SHORT$LAYOUT.withName("CameraType"),
        Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_version"),
        Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_ReleaseMode2"),
        Constants$root.C_LONG$LAYOUT.withName("Sony0x9400_SequenceImageNumber"),
        Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_SequenceLength1"),
        MemoryLayout.paddingLayout(24),
        Constants$root.C_LONG$LAYOUT.withName("Sony0x9400_SequenceFileNumber"),
        Constants$root.C_CHAR$LAYOUT.withName("Sony0x9400_SequenceLength2"),
        Constants$root.C_CHAR$LAYOUT.withName("AFAreaModeSetting"),
        Constants$root.C_SHORT$LAYOUT.withName("AFAreaMode"),
        MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("FlexibleSpotPosition"),
        Constants$root.C_CHAR$LAYOUT.withName("AFPointSelected"),
        Constants$root.C_CHAR$LAYOUT.withName("AFPointSelected_0x201e"),
        Constants$root.C_SHORT$LAYOUT.withName("nAFPointsUsed"),
        MemoryLayout.sequenceLayout(10, Constants$root.C_CHAR$LAYOUT).withName("AFPointsUsed"),
        Constants$root.C_CHAR$LAYOUT.withName("AFTracking"),
        Constants$root.C_CHAR$LAYOUT.withName("AFType"),
        MemoryLayout.sequenceLayout(4, Constants$root.C_SHORT$LAYOUT).withName("FocusLocation"),
        Constants$root.C_SHORT$LAYOUT.withName("FocusPosition"),
        Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjValue"),
        Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjOn"),
        Constants$root.C_CHAR$LAYOUT.withName("AFMicroAdjRegisteredLenses"),
        MemoryLayout.paddingLayout(8),
        Constants$root.C_SHORT$LAYOUT.withName("VariableLowPassFilter"),
        Constants$root.C_LONG$LAYOUT.withName("LongExposureNoiseReduction"),
        Constants$root.C_SHORT$LAYOUT.withName("HighISONoiseReduction"),
        MemoryLayout.sequenceLayout(2, Constants$root.C_SHORT$LAYOUT).withName("HDR"),
        Constants$root.C_SHORT$LAYOUT.withName("group2010"),
        Constants$root.C_SHORT$LAYOUT.withName("group9050"),
        Constants$root.C_SHORT$LAYOUT.withName("real_iso_offset"),
        Constants$root.C_SHORT$LAYOUT.withName("MeteringMode_offset"),
        Constants$root.C_SHORT$LAYOUT.withName("ExposureProgram_offset"),
        Constants$root.C_SHORT$LAYOUT.withName("ReleaseMode2_offset"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("MinoltaCamID"),
        Constants$root.C_FLOAT$LAYOUT.withName("firmware"),
        Constants$root.C_SHORT$LAYOUT.withName("ImageCount3_offset"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("ImageCount3"),
        Constants$root.C_LONG$LAYOUT.withName("ElectronicFrontCurtainShutter"),
        Constants$root.C_SHORT$LAYOUT.withName("MeteringMode2"),
        MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("SonyDateTime"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("ShotNumberSincePowerUp"),
        Constants$root.C_SHORT$LAYOUT.withName("PixelShiftGroupPrefix"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("PixelShiftGroupID"),
        Constants$root.C_CHAR$LAYOUT.withName("nShotsInPixelShiftGroup"),
        Constants$root.C_CHAR$LAYOUT.withName("numInPixelShiftGroup"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_ImageHeight"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_ImageWidth"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_Total_bps"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_Active_bps"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_StorageMethod"),
        Constants$root.C_SHORT$LAYOUT.withName("prd_BayerPattern"),
        Constants$root.C_SHORT$LAYOUT.withName("SonyRawFileType"),
        Constants$root.C_SHORT$LAYOUT.withName("RAWFileType"),
        MemoryLayout.paddingLayout(16),
        Constants$root.C_LONG$LAYOUT.withName("Quality"),
        Constants$root.C_SHORT$LAYOUT.withName("FileFormat"),
        MemoryLayout.sequenceLayout(16, Constants$root.C_CHAR$LAYOUT).withName("MetaVersion"),
        MemoryLayout.paddingLayout(16)
    );
    public static MemoryLayout $LAYOUT() {
        return libraw_sony_info_t.$struct$LAYOUT;
    }
    static final VarHandle CameraType$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("CameraType"));
    public static VarHandle CameraType$VH() {
        return libraw_sony_info_t.CameraType$VH;
    }
    public static short CameraType$get(MemorySegment seg) {
        return (short)libraw_sony_info_t.CameraType$VH.get(seg);
    }
    public static void CameraType$set( MemorySegment seg, short x) {
        libraw_sony_info_t.CameraType$VH.set(seg, x);
    }
    public static short CameraType$get(MemorySegment seg, long index) {
        return (short)libraw_sony_info_t.CameraType$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void CameraType$set(MemorySegment seg, long index, short x) {
        libraw_sony_info_t.CameraType$VH.set(seg.asSlice(index*sizeof()), x);
    }
